tests/mutants/b_validate_desync.patch
# kills: test_validate_py_passes
# suite: python3 -m unittest -k test_validate_py_passes tests.test_deck_data
# tools/decks.py alone drifts from the JSON embedded in index.html - the
# print deck and the app would ship different card copy.
diff --git a/tools/decks.py b/tools/decks.py
index efff726..8b6ab60 100644
--- a/tools/decks.py
+++ b/tools/decks.py
@@ -146,7 +146,7 @@ AMARA_SPEC = {
 
 AMARA_CHORDS = [
     ("Dm", "", "D MINOR", [3, 5, 7], {3}),
-    ("Dm", "7", "D MINOR 7", [3, 5, 7, 8], {3}),
+    ("Dm", "7", "D MINOR SEVEN", [3, 5, 7, 8], {3}),
     ("D5", "", "POWER CHORD", [3, 7], {3}),
     ("Dsus", "4", "SUSPENDED CHORD", [3, 6, 7], {3}),
     ("Am", "", "A MINOR", [1, 2, 4], {1}),
