tests/mutants/c_bottom_label_stored_figure.patch
# kills: test_bottom_labels_are_an_output_of_the_rule
# suite: python3 -m unittest -k test_bottom_labels_are_an_output_of_the_rule tests.test_print
# Reads the stored f_bnote figure again instead of deriving the bottom
# label from the rule (row 112).
diff --git a/tools/hifi.py b/tools/hifi.py
index 06ef98c..6dccc9c 100644
--- a/tools/hifi.py
+++ b/tools/hifi.py
@@ -301,7 +301,9 @@ def draw_pan(c, cx, cy, R, spec, active=frozenset(), roots=frozenset(),
         a = math.radians(ang)
         px, py = cx + orb * math.cos(a), cy + orb * math.sin(a)
         draw_ring(c, px, py, rr, state(i, zone == "bottom"))
-        fs = fit_note(nm, ov, "Label", label_size(rr, zone), rr * 1.40)
+        fs = fit_note(nm, ov, "Label",
+                      R * g["f_bnote"] if zone == "bottom"
+                      else label_size(rr, zone), rr * 1.40)
         note_text(c, px, py - rr * 0.30, nm, ov, "Label", fs, INK)
         if numbers:
             if zone == "bottom":
