tests/mutants/c_draw_ring_swap_colours.patch
# kills: test_state_selects_root_or_tone_colour_but_never_both
# suite: python3 -m unittest -k test_state_selects_root_or_tone_colour_but_never_both tests.test_print tests.test_pdf_build
# Root fields must light in the root colour, chord tones in the tone colour.
diff --git a/tools/hifi.py b/tools/hifi.py
--- a/tools/hifi.py
+++ b/tools/hifi.py
@@ -200,7 +200,7 @@ def draw_ring(c, x, y, r, state):
     c.circle(x, y, r, stroke=1, fill=1)
     if state in ("off",):
         return
-    col = BLUE if state in ("root", "ding-root") else GREEN
+    col = GREEN if state in ("root", "ding-root") else BLUE
     c.setStrokeColor(col)
     c.setLineWidth(r * 0.24)
     c.circle(x, y, r * 0.87, stroke=1, fill=0)
