tests/mutants/c_fit_floor.patch
# kills: test_fit_shrinks_overlong_text_but_stops_at_the_floor
# fit() must stop shrinking at its floor instead of vanishing.
diff --git a/tools/hifi.py b/tools/hifi.py
index f81d582..492460a 100644
--- a/tools/hifi.py
+++ b/tools/hifi.py
@@ -55,7 +55,7 @@ def tracked(c, x, y, text, font, size, track=0.0, align="l", color=None):
 
 
 def fit(text, font, size, maxw, track=0.0, floor=3.6):
-    while size > floor and tw(text, font, size, track * size / 10.0) > maxw:
+    while size > 0 and tw(text, font, size, track * size / 10.0) > maxw:
         size -= 0.25
     return size
 
