tests/mutants/c_gen_key_dropped.patch
# kills: test_every_builtin_deck_key_is_synthesised_or_named_as_omitted
# suite: python3 -m unittest -k test_every_builtin_deck_key_is_synthesised_or_named_as_omitted tests.test_print tests.test_pdf_build
# A print-only per-deck key vanishes from the generated deck without being
# declared omitted; the key inventory must notice.
diff --git a/tools/decks.py b/tools/decks.py
index b2b956c..985a5cd 100644
--- a/tools/decks.py
+++ b/tools/decks.py
@@ -334,7 +334,6 @@ def from_generated(payload):
              if has_bottom else "%d + 1" % len(tops)),
         credit=name.upper(),
         blurb=_blurb(spec, len(chords), warnings),
-        legend_lines=_legend_lines(spec, has_bottom),
         legend_demo=_legend_demo(spec, chords),
         # --- data -------------------------------------------------------
         spec=spec,
