tests/mutants/c_gen_page_count.patch
# kills: test_a_generated_deck_builds_a_pdf_with_the_expected_page_count
# suite: python3 -m unittest -k test_a_generated_deck_builds_a_pdf_with_the_expected_page_count tests.test_gen_deck
# The card list silently doubles, so the sheet count no longer matches the
# deck the printer was quoted.
diff --git a/tools/decks.py b/tools/decks.py
--- a/tools/decks.py
+++ b/tools/decks.py
@@ -310,6 +310,7 @@ def from_generated(payload):
     spec = _spec_from(generated)
     chords = [(c["main"], c["sup"], c["subtitle"], list(c["fields"]),
                set(c["roots"])) for c in generated["chords"]]
+    chords = chords + chords
     has_bottom = any(v[3] == "bottom" for k, v in spec.items() if k != "_geom")
 
     warnings = list(generated.get("warnings") or [])
