tests/mutants/c_gen_reject_exit_zero.patch
# kills: test_a_rejected_seed_exits_non_zero_with_the_engines_own_reason
# suite: python3 -m unittest -k test_a_rejected_seed_exits_non_zero_with_the_engines_own_reason tests.test_print tests.test_pdf_build
# A rejected seed must fail loudly: exiting 0 lets a pipeline read a refusal
# as an empty success and print nothing.
diff --git a/tools/gen_deck.js b/tools/gen_deck.js
index 2172a91..14649b7 100644
--- a/tools/gen_deck.js
+++ b/tools/gen_deck.js
@@ -60,7 +60,7 @@ const PRESETS = [
 
 function die(message) {
   process.stderr.write(message + "\n");
-  process.exit(1);
+  process.exit(0);
 }
 
 // A usage error, not an engine error: it carries NO enum code, because the
