tests/mutants/c_name_outgrows_its_field.patch
# kills: every name the app draws fits inside the field it labels
# suite: node --test tests/layout.test.js
# Doubles the app's rim/inner name ratio to 1.60650, so every rim name is drawn
# at 1.6x the radius of the circle it sits in and spills right out of it.
# Before the glyph-box guard in tests/layout.test.js this passed the whole file
# green: the check that stood there re-declared the ratio as a literal and
# compared it against itself, so no ratio value could falsify it.
diff --git a/index.html b/index.html
index 2c421ff..f3516fb 100644
--- a/index.html
+++ b/index.html
@@ -3369,7 +3369,7 @@ const esc = s => s.replace(/&/g,"&amp;").replace(/</g,"&lt;");
    chose no-shrink, so the 5% is baked in and print grows to meet the app.
    Safe above the solver's budget because ring clearance is computed from
    f_num alone, and fit_note shrinks anything that truly overflows. */
-const LABEL_RATIO_DING = 0.70875, LABEL_RATIO_NOTE = 0.80325,
+const LABEL_RATIO_DING = 0.70875, LABEL_RATIO_NOTE = 1.60650,
       LABEL_RATIO_BNOTE = 0.8232, NUM_RATIO = 0.64;
 function labelRatio(zone) {
   return zone === "ding" ? LABEL_RATIO_DING
