tests/mutants/c_note_line_order.patch
# kills: test_note_and_number_lines_print_in_spelling_order
# suite: python3 -m unittest -k test_note_and_number_lines_print_in_spelling_order tests.test_print tests.test_pdf_build
# The note line runs in chord-spelling order from the root, not pitch order.
diff --git a/tools/hifi.py b/tools/hifi.py
--- a/tools/hifi.py
+++ b/tools/hifi.py
@@ -152,7 +152,7 @@ def bottom_lines(c, x, y, w, fields, roots, meta, y_names, y_nums):
             break
         size -= 0.25
     px = x + (w - total) / 2
-    for i, f in enumerate(fields):
+    for i, f in enumerate(list(reversed(fields))):
         nm, ov = meta[f][0], meta[f][1]
         col = BLUE if f in roots else GREEN
         px += note_text(c, px, y_names, nm, ov, "Notes", size, col, centre=False)
