tests/mutants/c_num_outgrows_the_name.patch
# kills: test_every_name_is_larger_than_the_number_beside_it
# suite: python3 -m unittest -k test_every_name_is_larger_than_the_number_beside_it tests.test_print
# Sizes the index number above the note name, the hierarchy inversion
# review caught on Pygmy.
diff --git a/tools/hifi.py b/tools/hifi.py
index 06ef98c..030cacb 100644
--- a/tools/hifi.py
+++ b/tools/hifi.py
@@ -95,7 +95,7 @@ def note_w(name, octv, font, size):
 LABEL_RATIO_DING = 0.675     # name inside the ding
 LABEL_RATIO_NOTE = 0.765     # name inside a rim or inner field
 LABEL_RATIO_BNOTE = 0.784    # name inside a bottom-shell field
-NUM_RATIO = 0.64             # index number, from the top-field radius
+NUM_RATIO = 0.80             # index number, from the top-field radius
 
 
 def label_ratio(zone):
