tests/mutants/c_octave_digit_shrunk_under_the_floor.patch
# kills: test_no_label_falls_below_the_print_floor
# suite: python3 -m unittest -k test_no_label_falls_below_the_print_floor tests.test_print
# Shrinks the octave subscript. It is the smallest text in the PDFs, so a
# floor check that only measures alphabetic glyphs never sees this.
diff --git a/tools/hifi.py b/tools/hifi.py
--- a/tools/hifi.py
+++ b/tools/hifi.py
@@ -150,7 +150,7 @@ def note_text(c, x, y, name, octv, font, size, color=black, centre=True):
     c.setFillColor(color)
     c.setFont(font, size)
     c.drawString(x, y, name)
-    c.setFont(font, size * 0.66)
+    c.setFont(font, size * 0.40)
     c.drawString(x + pdfmetrics.stringWidth(name, font, size), y - size * 0.20, str(octv))
     return w
 
