tests/mutants/c_subtitle_tracking.patch
# kills: test_drawn_subtitle_fits_the_header_budget_on_every_card
# suite: python3 -m unittest -k test_drawn_subtitle_fits_the_header_budget_on_every_card tests.test_print tests.test_pdf_build
# The subtitle is measured with one tracking value and drawn with another;
# the DRAWN width is what has to fit the header budget.
diff --git a/tools/hifi.py b/tools/hifi.py
--- a/tools/hifi.py
+++ b/tools/hifi.py
@@ -124,7 +124,7 @@ def card_header(c, x, y, w, h, deck, num, subtitle, main, sup):
         tracked(c, x + 9, y + h - 21.5, num, "Label", 4.6, 0.4, "l", SEP)
     if subtitle:
         s = fit(subtitle, "LabelSB", 4.2, w * 0.60, track=0.55)
-        tracked(c, x + w - 9, y + h - 12.5, subtitle, "LabelSB", s, s * 0.055 * 2.4,
+        tracked(c, x + w - 9, y + h - 12.5, subtitle, "LabelSB", s, s * 0.055 * 24,
                 "r", INK)
     size = 27.0
     while size > 8 and (tw(main, "Display", size, size * 0.02)
