tests/mutants/d_add_keeps_edit_seed.patch
# kills: + ADD after an Edit opens a clean create sheet, never the edited deck's seed
# suite: node --test --test-name-pattern ^..ADD.after.an.Edit.opens.a.clean.create.sheet..never.the.edited.deck.s.seed$ tests/app.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -3380,7 +3380,6 @@ function showSheet(opener) {
 function openScaleSheet(opener) {
   editingId = null;
   setSheetMode(false);
-  scaleBox.value = "";
   nameBox.value = "";
   nameDirty = false;
   palette = 0;
