tests/mutants/d_caller_scan_strips_literals.patch
# kills: the caller scan counts occurrences of code and ignores every comment
# The caller scan's comment stripper stops tracking string literals, so a `/*`
# inside one opens a block comment again and blanks the live code that follows.
# Mutating a test file is precedent-backed (c_gen_pdf_oracle_blind does the
# same): what has to be proved live here is a test's own oracle. Four such
# evasions were demonstrated hiding a real second replaceRegistered call site
# while this suite stayed green, and only the synthetic assertions can prove
# they are caught - index.html can hold exactly one shape at a time.
diff --git a/tests/app.test.js b/tests/app.test.js
index c27b5f4..989ada6 100644
--- a/tests/app.test.js
+++ b/tests/app.test.js
@@ -2122,18 +2122,6 @@ function stripComments(source) {
       prevChar = ""; prevWord = "";
       continue;
     }
-    if (c === '"' || c === "'") {
-      const quote = c;
-      i++;
-      while (i < n) {
-        const d = source[i];
-        if (d === "\\") { i += 2; continue; }
-        if (d === quote || d === "\n") { i++; break; }
-        i++;
-      }
-      value();
-      continue;
-    }
     if (c === "`") { i++; mode = "tmpl"; continue; }
     if (c === "/") {
       const isRegex = prevChar === "" ||
