tests/mutants/d_chip_no_cap.patch
# kills: a custom chip label is capped at 16 characters with an ellipsis
# suite: node --test --test-name-pattern ^a.custom.chip.label.is.capped.at.16.characters.with.an.ellipsis$ tests/app.test.js
# Chip labels are no longer capped, so one long pan name can push the whole
# deck row - and the practice card with it - off a narrow screen.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -2269,7 +2269,7 @@ function setOrder() {
 const allDecks = () => [...DECKS, ...Object.values(CUSTOM)];
 // [5A] chip labels are capped at 16 characters with an ellipsis.
 const CHIP_CAP = 16;
-const chipLabel = n => (n.length > CHIP_CAP ? n.slice(0, CHIP_CAP - 1) + "…" : n);
+const chipLabel = n => n;
 
 function buildChips() {
   const nav = document.getElementById("decks");
