tests/mutants/d_chordsets_skip_bottom.patch
# kills: chordSets: a Pygmy chord on a bottom note lights that bottom field
# suite: node --test --test-name-pattern ^chordSets..a.Pygmy.chord.on.a.bottom.note.lights.that.bottom.field$ tests/app.test.js
diff --git a/index.html b/index.html
index 2b54068..e139e44 100644
--- a/index.html
+++ b/index.html
@@ -143,6 +143,7 @@ function chordSets(d, ch) {
   const rpc = pc(d, ch.roots[0]);
   const blue = new Set(), green = new Set();
   for (const f in d.fields) {
+    if (d.fields[f][3] === "bottom") continue;
     const p = pc(d, +f);
     if (p === rpc) blue.add(+f);
     else if (pcs.has(p)) green.add(+f);
