tests/mutants/d_chordsets_skip_ding.patch
# kills: chordSets: Amara Gsus4 lights the ding as a chord tone
# suite: node --test --test-name-pattern ^chordSets..Amara.Gsus4.lights.the.ding.as.a.chord.tone$ tests/app.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -143,6 +143,7 @@ function chordSets(d, ch) {
   const rpc = pc(d, ch.roots[0]);
   const blue = new Set(), green = new Set();
   for (const f in d.fields) {
+    if (d.fields[f][3] === "ding") continue;
     const p = pc(d, +f);
     if (p === rpc) blue.add(+f);
     else if (pcs.has(p)) green.add(+f);
