tests/mutants/d_collision_builds_to_id.patch
# kills: a refused save still runs select.build exactly once (13A)
# suite: node --test --test-name-pattern ^a.refused.save.still.runs.select.build.exactly.once..13A.$ tests/app.test.js
diff --git a/index.html b/index.html
index 3509543..3c6f5c1 100644
--- a/index.html
+++ b/index.html
@@ -3474,7 +3474,7 @@ function runGenerate() {
   let taken = null;
   const res = generateDeck(String(scaleBox.value || ""), sheetOptions(), (seed) => {
     if (!wasId) return null;
-    const id = HPE.core.deckId(seed.fields);
+    const id = HPE.select.build(seed).value.id;
     if (id === wasId || !CUSTOM[id]) return null;
     taken = CUSTOM[id];
     return { ok: false };
