tests/mutants/d_deck_copies_registry.patch
# kills: generation runs once at submit, never inside deck() or render()
# suite: node --test --test-name-pattern ^generation.runs.once.at.submit..never.inside.deck...or.render..$ tests/app.test.js
# deck() hands out a fresh copy per call, which is the shape a per-call rebuild
# would have: identity is the only thing that distinguishes them.
diff --git a/index.html b/index.html
index b018e51..6fb3608 100644
--- a/index.html
+++ b/index.html
@@ -2391,7 +2391,7 @@ let order = [], idx = 0, flipped = false;
 // need that). deck() resolves a custom id out of the registry; it never builds.
 const CUSTOM = Object.create(null);
 
-const deck = () => CUSTOM[deckId] || DECKS.find(d => d.id === deckId) || DECKS[0];
+const deck = () => (CUSTOM[deckId] ? {...CUSTOM[deckId]} : DECKS.find(d => d.id === deckId) || DECKS[0]);
 // Any deck id persists, built-in or custom: a custom deck is rebuilt at boot
 // from its saved seed, so restoring one is no longer a dangling reference.
 // READ-MODIFY-WRITE: "hpfc" is one object shared with whatever else stores
