tests/mutants/d_degrees_ignored.patch
# kills: the Degrees select lists the parent candidates with the inferred one preselected
# suite: node --test --test-name-pattern ^the.Degrees.select.lists.the.parent.candidates.with.the.inferred.one.preselected$ tests/app.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -6815,7 +6815,6 @@
 function sheetOptions() {
   const o = { palette, mirror };
   if (editingId) {
-    o.parent = Number(degSel.value);
     // iOS Smart Punctuation turns a typed ' or " into a curly U+2018/2019/
     // U+201C/U+201D, which core.js's NAME_RE (ASCII-only) then refuses - so a
     // name is normalised back to ASCII before it ever reaches the engine.
