tests/mutants/d_delete_keeps_record.patch
# kills: deleting the SELECTED custom deck falls back to a built-in, says so, and stays gone
# suite: node --test --test-name-pattern ^deleting.the.SELECTED.custom.deck.falls.back.to.a.built.in..says.so..and.stays.gone$ tests/app.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -2917,7 +2917,6 @@ function deleteDeck(id) {
   const gone = d.name;
   const wasSelected = deckId === id;
   delete CUSTOM[id];
-  forgetScale(HPE.core.formatSeed(d.fields));
   if (editingId === id) closeScaleSheet();
   if (!wasSelected) { buildChips(); return; }
   selectDeck(DECKS[0].id);
