tests/mutants/d_delete_skips_the_confirmation.patch
# kills: DELETE THIS DECK arms on the first tap and only deletes on the second
# suite: node --test --test-name-pattern DELETE.THIS.DECK.arms.on.the.first.tap tests/app.test.js
# The armed check goes away, so the first tap deletes - the one-tap destruction
# the owner asked to be gated on 2026-09-17.
diff --git a/index.html b/index.html
index 93dabcf..2d208f1 100644
--- a/index.html
+++ b/index.html
@@ -4887,7 +4887,8 @@ delBtn.onclick = () => {
   /* Disarm BEFORE the delete, not inside it: the state must not outlive the
      deck even when deleteDeck turns out to have nothing to remove, and the
      delete's own message should be the last thing said. */
-  if (delArmed) { disarmDelete(); deleteDeck(editingId); return; }
+  deleteDeck(editingId);
+  if (delArmed) return;
   delArmed = true;
   delBtn.textContent = DEL_ARMED;
   delBtn.setAttribute("data-armed", "");
