tests/mutants/d_delete_stays_armed_across_visits.patch
# kills: leaving the Edit page disarms DELETE, so a stale tap cannot destroy a deck
# suite: node --test --test-name-pattern leaving.the.Edit.page.disarms.DELETE tests/app.test.js
# Opening the page no longer disarms the button, so a confirmation given in one
# visit is still live in the next one and a single tap destroys a deck.
diff --git a/index.html b/index.html
index 169aa79..0098ee4 100644
--- a/index.html
+++ b/index.html
@@ -4641,7 +4641,6 @@ if (window.visualViewport) {
 
 /** Show or hide the three Edit-only rows and relabel the single primary. */
 function setSheetMode(edit) {
-  disarmDelete();
   for (const el of [nameRow, degRow, layoutRow, delRow]) {
     if (edit) el.removeAttribute("hidden"); else el.setAttribute("hidden", "");
   }
