tests/mutants/d_disarm_skips_placeholder_repaint.patch
# kills: clearing the seed box then tapping a pan note still chooses it while DELETE is armed (queue row 117)
# suite: node --test --test-name-pattern ^clearing.the.seed.box.then.tapping.a.pan.note.still.chooses.it.while.DELETE.is.armed..queue.row.117.$ tests/e2e.test.js
# The paint guard on the empty-seed branch exists for the same reason as its
# sibling on the parsed branch (d_disarm_repaints_the_pan.patch): disarmDelete()
# calls syncParseState({paint:false}) from inside a pointerdown, and repainting
# the placeholder pan there detaches the .panhit the press landed on, so the
# click retargets to an ancestor and the delegated handler drops the tap. Drop
# the guard here and an empty-seed disarm swallows the very tap that follows it.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4575,7 +4575,7 @@
     parseLine.textContent = PARSE_HINT;
     scaleBox.classList.remove("bad");
     genBtn.disabled = true;
-    if (paint) showPlaceholderPan();
+    showPlaceholderPan();
     say("", "");
     return;
   }
