tests/mutants/d_disarm_skips_the_resync.patch
# kills: cancelling an armed DELETE re-syncs the box, GENERATE and the message (queue row 91)
# suite: node --test --test-name-pattern ^cancelling.an.armed.DELETE.re.syncs.the.box..GENERATE.and.the.message..queue.row.91.$ tests/e2e.test.js
# The disarm clears the announcer instead of re-deriving the sheet, which is
# what disarmDelete() did before queue row 91. The label goes back to idle and
# the line goes quiet, but .bad and GENERATE still carry whatever they said
# before DELETE was armed: the box is red for a reason the page no longer
# gives. Distinct from d_disarm_strands_the_warning, which drops the re-derive
# entirely and strands the arming warning instead of clearing it.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4951,7 +4951,7 @@
   // Otherwise re-derive .bad, #scale-msg and GENERATE's disabled state from
   // the field's CURRENT text, so the three cannot disagree (queue row 91) -
   // WITHOUT repainting the pan, because this runs inside a pointerdown.
-  syncParseState({ paint: false });
+  say("");
 }
 delBtn.onclick = () => {
   /* Belt and braces, and deliberately NOT mutant-covered (queue row 86, N6).
