tests/mutants/d_disarm_strands_the_warning.patch
# kills: disarming DELETE takes its warning down with it
# suite: node --test --test-name-pattern ^disarming.DELETE.takes.its.warning.down.with.it$ tests/app.test.js
# The label goes back to idle and the amber line keeps saying the deck cannot
# be recovered, so the page warns about a thing it is no longer about to do.
# (Queue row 91 rewrote disarmDelete() to re-derive the sheet's state instead
#  of a bare say(""), so this mutant now drops that re-derivation - same
#  defect, current code.) Distinct from d_disarm_skips_the_resync, which puts
#  the bare say("") back: there the line goes quiet while .bad and GENERATE
#  stay stale; here it keeps saying the deck cannot be recovered.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4948,10 +4948,6 @@
   // clear a red box and offer SAVE CHANGES for an edit the app still refuses.
   // Put the refusal back over the arming warning and leave the rest alone.
   if (refusal) { say(refusal, "err"); return; }
-  // Otherwise re-derive .bad, #scale-msg and GENERATE's disabled state from
-  // the field's CURRENT text, so the three cannot disagree (queue row 91) -
-  // WITHOUT repainting the pan, because this runs inside a pointerdown.
-  syncParseState({ paint: false });
 }
 delBtn.onclick = () => {
   /* Belt and braces, and deliberately NOT mutant-covered (queue row 86, N6).
