tests/mutants/d_edit_moves_selection.patch
# kills: a field edit keeps the edited deck selected and renames its chip from the new fields
# suite: node --test --test-name-pattern ^a.field.edit.keeps.the.edited.deck.selected.and.renames.its.chip.from.the.new.fields$ tests/app.test.js
diff --git a/index.html b/index.html
index 8a5bb64..2b413cd 100644
--- a/index.html
+++ b/index.html
@@ -3419,7 +3419,7 @@ function runGenerate() {
   dropLayoutPreview();
   closeScaleSheet();
   if (replaced) replaceScale(wasSeed, seedOf(d)); else rememberScale(seedOf(d));
-  selectDeck(d.id);
+  selectDeck(replaced ? DECKS[0].id : d.id);
   say(text, warned.length ? "warn" : "ok");
   genBtn.disabled = false;
 }
