tests/mutants/d_edit_not_prefilled.patch
# kills: tapping the already-selected custom chip opens the sheet in Edit state, prefilled
# suite: node --test --test-name-pattern ^tapping.the.already.selected.custom.chip.opens.the.sheet.in.Edit.state..prefilled$ tests/app.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -3398,7 +3398,7 @@ function openEditSheet(d, opener) {
   setSheetMode(true);
   nameBox.value = d.name;
   nameDirty = false;                                 // prefilled, not typed
-  scaleBox.value = HPE.core.formatSeed(d.fields);     // 8A: the canonical string
+  scaleBox.value = "";
   palette = d.options.palette;
   buildSwatches();
   setMirror(!!d.options.mirror);
