tests/mutants/d_edit_option_forgets.patch
# kills: an options-only edit still replaces in place and keeps its stored record
# suite: node --test --test-name-pattern ^an.options.only.edit.still.replaces.in.place.and.keeps.its.stored.record$ tests/app.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4810,7 +4810,7 @@ function runGenerate() {
   if (warned.length) text += " " + warned.join(" ");
 
   closeScaleSheet();
-  if (replaced) replaceScale(wasSeed, seedOf(d)); else rememberScale(seedOf(d));
+  rememberScale(seedOf(d)); if (wasId) forgetScale(wasSeed);
   selectDeck(d.id);
   say(text, warned.length ? "warn" : "ok");
   genBtn.disabled = false;
