tests/mutants/d_edit_resurrects.patch
# kills: a boot after a field edit shows exactly one deck, in the same chip position
# suite: node --test --test-name-pattern ^a.boot.after.a.field.edit.shows.exactly.one.deck..in.the.same.chip.position$ tests/app.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -2773,7 +2773,7 @@ function forgetScale(str) {
 function replaceScale(oldStr, seed) {
   const rec = { v: SHARE_VERSION, s: HPE.core.formatSeed(seed.fields), o: seed.options };
   const list = savedScales();
-  const at = list.findIndex(r => r && r.s === oldStr);
+  const at = list.length - 1;
   if (at < 0) { rememberScale(seed); return; }
   const out = [];
   list.forEach((r, i) => {
