tests/mutants/d_empty_box_shows_no_example.patch
# kills: an empty box shows the placeholder seed as an example
# suite: node --test --test-name-pattern ^an.empty.box.shows.the.placeholder.seed.as.an.example$ tests/preview.test.js
# The empty box draws nothing again, so the only teaching of the seed grammar
# before the first keystroke is the text hint, and the plate enters the flow on
# the first character.
diff --git a/index.html b/index.html
index 79d9295..935d7cc 100644
--- a/index.html
+++ b/index.html
@@ -4506,8 +4506,7 @@ function showPanPreview(seed) {
  * PARSE_HINT are the only teaching of the grammar there is, and this way the
  * example drawn is provably the example shown. */
 function showPlaceholderPan() {
-  const res = HPE.core.parseSeed(String(scaleBox.placeholder || ""), sheetOptions());
-  if (!res.ok || !paintPan(res.value, "example")) clearPanPreview();
+  clearPanPreview();
 }
 
 /** Invalid parse: keep the render but stop it claiming to be current. Mid-word
