tests/mutants/d_generate_enabled_when_invalid.patch
# kills: NO_DING shows the engine's own sentence and keeps Generate disabled
# suite: node --test --test-name-pattern ^NO_DING.shows.the.engine.s.own.sentence.and.keeps.Generate.disabled$ tests/app.test.js
# Generate stays live while the seed does not parse, so the primary action
# invites a tap that can only fail.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4704,7 +4704,7 @@ function syncParseState({ paint }) {
     // #scale-refusal takes the identical box - so a half-typed seed neither
     // jumps the sheet nor costs the fieldrow a second reserved line.
     scaleBox.classList.add("bad");
-    genBtn.disabled = true;
+    genBtn.disabled = false;
     if (paint) holdPanPreview();
     showRefusal(res.reason);
   }
