tests/mutants/d_held_pan_claims_current.patch
# kills: an unparseable seed holds the last pan but stops it claiming to be current
# suite: node --test --test-name-pattern ^an.unparseable.seed.holds.the.last.pan.but.stops.it.claiming.to.be.current$ tests/preview.test.js
# A held or example pan keeps the live name and the live treatment, so the
# mock claims to show a layout the box no longer describes - the exact way a
# preview lies, now that the plate never leaves the flow.
diff --git a/index.html b/index.html
index 79d9295..f875565 100644
--- a/index.html
+++ b/index.html
@@ -4464,9 +4464,9 @@ let panState = "example";
 const PAN_EDIT_HINT = " Tap a note to choose it, or use the arrow keys.";
 function markPan(state) {
   panState = state;
-  previewBox.classList.toggle("stale", state !== "current");
+  previewBox.classList.remove("stale");
   previewBox.setAttribute("aria-label",
-    PAN_NAMES[state] + (editingId ? "." + PAN_EDIT_HINT : ""));
+    PAN_NAMES.current + (editingId ? "." + PAN_EDIT_HINT : ""));
 }
 
 /** Paint the pan mock for a parsed seed, unhighlighted. Returns false if the
