tests/mutants/d_hint_every_time.patch
# kills: the one-time layout hint is appended on the first generation of a deck, not the second
# suite: node --test --test-name-pattern ^the.one.time.layout.hint.is.appended.on.the.first.generation.of.a.deck..not.the.second$ tests/app.test.js
# The mirror hint is appended to every generation instead of the first per
# deck, so it degrades into noise the user learns to ignore.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4806,7 +4806,7 @@ function runGenerate() {
   const warned = (d.warnings || []).map(w => w.reason);
   let text = (replaced || known.has(d.id))
     ? `Updated ${d.name}` : `${d.chords.length} cards generated`;
-  if (!generated.has(d.id)) { generated.add(d.id); text += " " + LAYOUT_HINT; }
+  { generated.add(d.id); text += " " + LAYOUT_HINT; }
   if (warned.length) text += " " + warned.join(" ");
 
   closeScaleSheet();
