tests/mutants/d_layout_hint_only_a_comment.patch
# kills: the LAYOUT group explains itself on the page, not only in a comment
# suite: node --test --test-name-pattern ^the.LAYOUT.group.explains.itself.on.the.page..not.only.in.a.comment$ tests/app.test.js
# The sentence survives only as an HTML comment. This is the exact failure that
# test is NAMED for, and until the comment strip went in it was the one failure
# the test could not see: it regexes the raw file, and a comment is raw file.
# Nothing renders, the owner's question goes unanswered, and the suite stayed
# green. The e2e hint test kills this too, but the cheap unit oracle is the one
# that has to hold - it is the one whose name makes the promise.
diff --git a/index.html b/index.html
index 3034159..3394c75 100644
--- a/index.html
+++ b/index.html
@@ -758,7 +758,7 @@ button.nav:active{background:#2e281e}
            the correction is made on. It names the gesture before the buttons
            because nothing either button does means anything until a note is
            chosen. -->
-      <p class="sheethint" id="scale-layout-hint">Tap a note on the pan above, then ROTATE turns its whole ring one seat on, and MOVE swaps just that note with its neighbour. The pan follows every press.</p>
+      <!-- <p class="sheethint" id="scale-layout-hint">Tap a note on the pan above, then ROTATE turns its whole ring one seat on, and MOVE swaps just that note with its neighbour. The pan follows every press.</p> -->
       <div class="ctlrow" role="group" aria-labelledby="scale-layout-label"
            aria-describedby="scale-layout-hint">
         <div class="mirror">
