tests/mutants/d_layout_identity_stored.patch
# kills: rotating all the way round is absent again, never a stored identity
# A correction that undoes itself is stored anyway, so rotating the rim all
# the way round leaves a longer link than the deck started with.
diff --git a/index.html b/index.html
index 2a111a2..7a5a23e 100644
--- a/index.html
+++ b/index.html
@@ -3088,7 +3088,7 @@ function orderFromSlots(at) {
 }
 /** ABSENT, never the identity: a correction that undoes itself is no correction. */
 function setLayoutOrder(next) {
-  layoutOrder = next.every((slot, i) => slot === i) ? null : next;
+  layoutOrder = next;
 }
 const editedDeck = () => (editingId ? CUSTOM[editingId] : null) || null;
 /** The half-open slot range of the zone a slot belongs to. */
