tests/mutants/d_layout_order_not_saved.patch
# kills: ROTATE moves every note one position and SAVE keeps the id but moves the link
# suite: node --test --test-name-pattern ^ROTATE.moves.every.note.one.position.and.SAVE.keeps.the.id.but.moves.the.link$ tests/app.test.js
# The sheet previews the correction and then drops it on save, so SAVE
# CHANGES silently throws the correction away.
diff --git a/index.html b/index.html
index 3509543..eeaa568 100644
--- a/index.html
+++ b/index.html
@@ -3330,7 +3330,6 @@ function sheetOptions() {
     const d = editedDeck();
     const kept = !!(d && d.options && d.options.name);
     if (n && (nameDirty || kept)) o.name = n;  // validated by core.parseSeed, never here
-    if (layoutOrder) o.order = layoutOrder.slice();
   }
   return o;
 }
