tests/mutants/d_layout_order_not_saved.patch
# kills: ROTATE moves every note one position and SAVE keeps the id but moves the link
# The sheet previews the correction and then drops it on save, so SAVE
# CHANGES silently throws the correction away.
diff --git a/index.html b/index.html
index 8a5bb64..89cf8ce 100644
--- a/index.html
+++ b/index.html
@@ -3260,7 +3260,6 @@ function sheetOptions() {
     const d = editedDeck();
     const auto = d ? HPE.select.autoName(d.fields, d.options.parent) : null;
     if (n && n !== auto) o.name = n;  // validated by core.parseSeed, never here
-    if (layoutOrder) o.order = layoutOrder.slice();
   }
   return o;
 }
