tests/mutants/d_mirror_ignored.patch
# kills: the mirror pair defaults to right-first and carries the choice into the deck
# suite: node --test --test-name-pattern ^the.mirror.pair.defaults.to.right.first.and.carries.the.choice.into.the.deck$ tests/app.test.js
# LEFT-FIRST lights up but the choice never reaches the engine, so a mirrored
# pan is always laid out the wrong way round.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -2819,7 +2819,7 @@ function buildDegrees(selected) {
 
 /** The seed options the sheet currently describes. */
 function sheetOptions() {
-  const o = { palette, mirror };
+  const o = { palette, mirror: false };
   if (editingId) {
     o.parent = Number(degSel.value);
     const n = String(nameBox.value || "").trim();
