tests/mutants/d_msg_no_error_tier.patch
# kills: BAD_NOTE shows the engine's own sentence and keeps Generate disabled
# suite: node --test --test-name-pattern ^BAD_NOTE.shows.the.engine.s.own.sentence.and.keeps.Generate.disabled$ tests/app.test.js
# The reason is rendered in the neutral tier, so an error reads exactly like
# a success and the three-tier colour scale carries no information.
diff --git a/index.html b/index.html
index f7b0bb9..d98f617 100644
--- a/index.html
+++ b/index.html
@@ -3484,7 +3484,7 @@ function updateParse() {
     scaleBox.classList.add("bad");
     genBtn.disabled = true;
     clearPanPreview();
-    say(res.reason, "err");
+    say(res.reason, "");
   }
 }
 
