tests/mutants/d_name_always_kept.patch
# kills: an untouched Edit box still leaves an auto-named deck free to re-derive its name
# suite: node --test --test-name-pattern ^an.untouched.Edit.box.still.leaves.an.auto.named.deck.free.to.re.derive.its.name$ tests/app.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -3329,7 +3329,7 @@ function sheetOptions() {
     // that already carries an EXPLICIT name keeps it either way.
     const d = editedDeck();
     const kept = !!(d && d.options && d.options.name);
-    if (n && (nameDirty || kept)) o.name = n;  // validated by core.parseSeed, never here
+    if (n) o.name = n;  // validated by core.parseSeed, never here
     if (layoutOrder) o.order = layoutOrder.slice();
   }
   return o;
