tests/mutants/d_no_deck_fallback.patch
# kills: an unknown stored deck id falls back to the first deck
# suite: node --test --test-name-pattern ^an.unknown.stored.deck.id.falls.back.to.the.first.deck$ tests/app.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -2391,7 +2391,7 @@ let order = [], idx = 0, flipped = false;
 // need that). deck() resolves a custom id out of the registry; it never builds.
 const CUSTOM = Object.create(null);
 
-const deck = () => CUSTOM[deckId] || DECKS.find(d => d.id === deckId) || DECKS[0];
+const deck = () => CUSTOM[deckId] || DECKS.find(d => d.id === deckId);
 // Any deck id persists, built-in or custom: a custom deck is rebuilt at boot
 // from its saved seed, so restoring one is no longer a dangling reference.
 // READ-MODIFY-WRITE: "hpfc" is one object shared with whatever else stores
