tests/mutants/d_page_route_not_pushed.patch
# kills: opening ADD pushes its own route and closing pops it
# suite: node --test --test-name-pattern ^opening.ADD.pushes.its.own.route.and.closing.pops.it$ tests/app.test.js
# The page opens without taking a history entry, so the phone's back gesture
# skips past it and leaves the app instead of closing the page.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4756,8 +4756,6 @@ function showSheet(opener) {
   for (const el of background) { el.inert = true; el.setAttribute("aria-hidden", "true"); }
   resyncSheet(true);
   applyKbOffset();
-  history.pushState({ scalePage: true }, "", sheetRoute());
-  sheetRouted = true;
   // The owner's second request: do not steal focus into the box, so the whole
   // page is readable before anything is typed and no soft keyboard covers it.
   // Focus still has to LEAVE the background - it is inert the line above, and
