tests/mutants/d_pan_no_hairline.patch
# kills: pan() draws one circle per field, two more per lit field, plus the chrome
# suite: node --test --test-name-pattern ^pan...draws.one.circle.per.field..two.more.per.lit.field..plus.the.chrome$ tests/app.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -177,7 +177,6 @@ function pan(d, ch) {
       out += `<circle cx="${x}" cy="${y}" r="${r}" fill="#fff" stroke="#000" stroke-width="1.1"/>`;
     if (st === "root" || st === "tone") {
       out += `<circle cx="${x}" cy="${y}" r="${r*0.87}" fill="none" stroke="${st==="root"?C.root:C.tone}" stroke-width="${r*0.24}"/>`;
-      out += `<circle cx="${x}" cy="${y}" r="${r*0.74}" fill="none" stroke="#000" stroke-width="0.9"/>`;
     }
     return out;
   }
