tests/mutants/d_panhit_centres_transposed.patch
# kills: every hit target is centred on the field circle it selects
# suite: node --test --test-name-pattern ^every.hit.target.is.centred.on.the.field.circle.it.selects$ tests/app.test.js
# Swaps cx and cy on the hit target. The layer still has exactly the right
# number of correctly-labelled targets - they are all in the wrong places, and
# every tap on the pan selects a note reflected across the diagonal.
diff --git a/index.html b/index.html
index 79d9295..e386bca 100644
--- a/index.html
+++ b/index.html
@@ -3866,7 +3866,7 @@ function pan(d, ch, opts) {
         rings.push(`<circle class="pansel" cx="${x}" cy="${y}" r="${rr * 1.2}"`
           + ` fill="none" stroke="#E27005" stroke-width="${R * 0.016}"`
           + ` pointer-events="none"/>`);
-      hits.push(`<circle class="panhit" data-field="${id}" cx="${x}" cy="${y}" r="${rr}"`
+      hits.push(`<circle class="panhit" data-field="${id}" cx="${y}" cy="${x}" r="${rr}"`
         + ` data-r="${rr}" fill="transparent" tabindex="-1" role="button"`
         + ` aria-selected="${on}"${on ? ' data-sel="true"' : ""}`
         + ` aria-label="${escA(name + oct)}, position ${escA(String(lab))} of ${selectable}"/>`);
