tests/mutants/d_panhit_drops_drawn_radius.patch
# kills: every hit target is centred on the field circle it selects
# suite: node --test --test-name-pattern ^every.hit.target.is.centred.on.the.field.circle.it.selects$ tests/app.test.js
# Drops data-r from the emitted target. The sizer then has no drawn radius to
# floor at, so on a sparse pan every target silently shrinks from the note ring
# the user is aiming at (53.8px on Hijaz) down to the bare 44px minimum.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -3867,7 +3867,7 @@ function pan(d, ch, opts) {
           + ` fill="none" stroke="#E27005" stroke-width="${R * 0.016}"`
           + ` pointer-events="none"/>`);
       hits.push(`<circle class="panhit" data-field="${id}" cx="${x}" cy="${y}" r="${rr}"`
-        + ` data-r="${rr}" fill="transparent" tabindex="-1" role="button"`
+        + ` fill="transparent" tabindex="-1" role="button"`
         + ` aria-selected="${on}"${on ? ' data-sel="true"' : ""}`
         + ` aria-label="${escA(name + oct)}, position ${escA(String(lab))} of ${selectable}"/>`);
     }
