tests/mutants/d_panhit_field_pairing_rotated.patch
# kills: every hit target is centred on the field circle it selects
# suite: node --test --test-name-pattern ^every.hit.target.is.centred.on.the.field.circle.it.selects$ tests/app.test.js
# Rotates data-field by one across the targets. Every target still sits on a
# real field and still announces the correct note for where it is, so a check
# that only asks 'is this centre one of the drawn centres' passes - but the id
# a tap reports is the neighbour's, and the scale page selects the wrong note.
diff --git a/index.html b/index.html
index 79d9295..a494478 100644
--- a/index.html
+++ b/index.html
@@ -3875,7 +3875,9 @@ function pan(d, ch, opts) {
   // After every field, so a target is never painted under the pan it selects,
   // and the ring under the targets so it can never eat a tap.
   if (interactive) s += `<g class="pansels">${rings.join("")}</g>`
-                      + `<g class="panhits">${hits.join("")}</g>`;
+                      + `<g class="panhits">${hits.map((h, i) =>
+    h.replace(/data-field="\d+"/,
+      hits[(i + 1) % hits.length].match(/data-field="\d+"/)[0])).join("")}</g>`;
   return s + "</svg>";
 }
 
