tests/mutants/d_panhit_ignores_overlap_cap.patch
# kills: every built-in pan holds disjoint hit targets at the page-scale width
# suite: node --test --test-name-pattern ^every.built-in.pan.holds.disjoint.hit.targets.at.the.page-scale.width$ tests/app.test.js
# Drops the non-overlap cap from the hit radius, so on a crowded pan (Pygmy has
# 17 selectable fields) neighbouring targets lap each other and a tap selects
# the wrong note.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -3848,7 +3848,7 @@
     for (let j = 0; j < pts.length; j += 1)
       if (j !== i)
         half = Math.min(half, Math.hypot(p[0] - pts[j][0], p[1] - pts[j][1]) / 2);
-    return Math.min(Math.max((minPx / 2) * scale, p[2] || 0), half);
+    return Math.max((minPx / 2) * scale, p[2] || 0);
   });
 }
 
