tests/mutants/d_panhit_layer_drawn_first.patch
# kills: the hit layer is emitted after everything it sits over
# suite: node --test --test-name-pattern ^the.hit.layer.is.emitted.after.everything.it.sits.over$ tests/app.test.js
# Emits the hit layer immediately after the <svg> open tag instead of last. SVG
# paints in document order with no z-index, so every target ends up under an
# opaque white field circle and no tap on a note ever reaches it.
diff --git a/index.html b/index.html
index 79d9295..3e4e5f0 100644
--- a/index.html
+++ b/index.html
@@ -3874,8 +3874,9 @@ function pan(d, ch, opts) {
   }
   // After every field, so a target is never painted under the pan it selects,
   // and the ring under the targets so it can never eat a tap.
-  if (interactive) s += `<g class="pansels">${rings.join("")}</g>`
-                      + `<g class="panhits">${hits.join("")}</g>`;
+  if (interactive) s = s.replace(`xmlns="http://www.w3.org/2000/svg">`,
+    `xmlns="http://www.w3.org/2000/svg"><g class="pansels">${rings.join("")}</g>`
+    + `<g class="panhits">${hits.join("")}</g>`);
   return s + "</svg>";
 }
 
