tests/mutants/d_panhit_position_unescaped.patch
# kills: a note name cannot break out of the hit target's attributes
# suite: node --test --test-name-pattern ^a.note.name.cannot.break.out.of.the.hit.target.s.attributes$ tests/app.test.js
# Escapes the note name but NOT the position label. A quote there truncates
# the aria-label and leaves ' of 8"' as stray in-tag markup - which carries no
# attribute name, so a check on the tag's attribute NAMES alone cannot see it.
# The label ending where it should is what catches it.
diff --git a/index.html b/index.html
index 79d9295..0c32376 100644
--- a/index.html
+++ b/index.html
@@ -3869,7 +3869,7 @@ function pan(d, ch, opts) {
       hits.push(`<circle class="panhit" data-field="${id}" cx="${x}" cy="${y}" r="${rr}"`
         + ` data-r="${rr}" fill="transparent" tabindex="-1" role="button"`
         + ` aria-selected="${on}"${on ? ' data-sel="true"' : ""}`
-        + ` aria-label="${escA(name + oct)}, position ${escA(String(lab))} of ${selectable}"/>`);
+        + ` aria-label="${escA(name + oct)}, position ${String(lab)} of ${selectable}"/>`);
     }
   }
   // After every field, so a target is never painted under the pan it selects,
