tests/mutants/d_pc_no_mod.patch
# kills: chordSets: Amara C major has two root-coloured fields (C4 + C5)
diff --git a/index.html b/index.html
index 2b54068..bb8d996 100644
--- a/index.html
+++ b/index.html
@@ -137,7 +137,7 @@ const deck = () => DECKS.find(d => d.id === deckId) || DECKS[0];
 const save = () => { try { localStorage.setItem("hpfc", JSON.stringify({deck: deckId, mode})); } catch (e) {} };
 
 /* ---------------- helpers ---------------- */
-const pc = (d, f) => d.fields[f][2] % 12;
+const pc = (d, f) => d.fields[f][2];
 function chordSets(d, ch) {
   const pcs = new Set(ch.fields.map(f => pc(d, f)));
   const rpc = pc(d, ch.roots[0]);
