tests/mutants/d_preset_seed_drift.patch
# kills: the app's presets and tools/gen_deck.js's PRESETS cannot drift apart
# suite: node --test --test-name-pattern ^the.app.s.presets.and.tools.gen_deck.js.s.PRESETS.cannot.drift.apart$ tests/app.test.js
diff --git a/index.html b/index.html
index 7e9b7f6..fa0e7b2 100644
--- a/index.html
+++ b/index.html
@@ -3079,7 +3079,7 @@ const PARSE_HINT = "Type your ding first, e.g. (D) or D/";
 // two lists to each other so they cannot drift.
 const SCALE_PRESETS = [
   { id: "d_kurd_9", label: "D Kurd 9",
-    seed: "(D3) A3 Bb3 C4 D4 E4 F4 G4 A4" },
+    seed: "(D3) A3 Bb3 C4 D4 E4 F4 G4 A5" },
   { id: "d_celtic_minor_9", label: "D Celtic Minor 9",
     seed: "(D3) A3 C4 D4 E4 G4 A4 C5 D5" },
   { id: "csharp_annaziska_9", label: "C# Annaziska 9",
