tests/mutants/d_registry_ignored.patch
# kills: a generated deck resolves through deck() without joining the DECKS literal
# suite: node --test --test-name-pattern ^a.generated.deck.resolves.through.deck...without.joining.the.DECKS.literal$ tests/app.test.js
# deck() stops consulting the generated-deck registry, so a custom id silently
# renders the first built-in deck instead.
diff --git a/index.html b/index.html
index b018e51..fa6352a 100644
--- a/index.html
+++ b/index.html
@@ -2391,7 +2391,7 @@ let order = [], idx = 0, flipped = false;
 // need that). deck() resolves a custom id out of the registry; it never builds.
 const CUSTOM = Object.create(null);
 
-const deck = () => CUSTOM[deckId] || DECKS.find(d => d.id === deckId) || DECKS[0];
+const deck = () => DECKS.find(d => d.id === deckId) || DECKS[0];
 // Any deck id persists, built-in or custom: a custom deck is rebuilt at boot
 // from its saved seed, so restoring one is no longer a dangling reference.
 // READ-MODIFY-WRITE: "hpfc" is one object shared with whatever else stores
