tests/mutants/d_replace_registered_same_line_caller.patch
# kills: replaceRegistered has exactly one call site, and a new one must read the return
# suite: node --test --test-name-pattern ^replaceRegistered.has.exactly.one.call.site..and.a.new.one.must.read.the.return$ tests/app.test.js
# Queue row 159. Distinct from d_replace_registered_second_caller: that one adds
# a whole new LINE, this one appends the second call to the line that already
# names the function. A scan that filters lines rather than counting
# occurrences sees no change at all and lets this through silently.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -3574,7 +3574,7 @@ function runGenerate() {
   // and the new one takes its chip position. An options-only edit never gets
   // here - the id is unchanged and generateDeck already replaced it in place.
   const replaced = !!wasId && d.id !== wasId;
-  if (replaced) replaceRegistered(wasId, d);
+  if (replaced) replaceRegistered(wasId, d); else replaceRegistered(d.id, d);
   // [eng-review 2, 2A] the warnings are read off the deck the SAME generation
   // produced; nothing is rebuilt to re-derive them.
   const warned = (d.warnings || []).map(w => w.reason);
