tests/mutants/d_save_drops_mode.patch
# kills: deck and mode round-trip through localStorage (subset semantics)
# suite: node --test --test-name-pattern ^deck.and.mode.round.trip.through.localStorage..subset.semantics.$ tests/app.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -5497,7 +5497,6 @@ const save = () => {
     const base = readStore(STORE_KEY);
     const next = (base && typeof base === "object" && !Array.isArray(base)) ? base : {};
     next.deck = storedDeck;
-    next.mode = mode;
     next.printPaper = printPaper;
     localStorage.setItem(STORE_KEY, JSON.stringify(next));
   } catch (e) {}
