tests/mutants/d_save_ignores_custom.patch
# kills: selecting a deck persists its id, custom decks included
# suite: node --test --test-name-pattern ^selecting.a.deck.persists.its.id..custom.decks.included$ tests/app.test.js
# selectDeck reinstates the Phase 3 built-ins-only guard, so a custom deck the
# user selected is not restored on the next boot.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -3002,7 +3002,7 @@ function selectDeck(id) {
   const rehome = !!a && a !== document.body &&
     (a.id === "deck-add" || !!(a.closest && a.closest("#decks")));
   deckId = id;
-  storedDeck = id;
+  if (isBuiltIn(id)) storedDeck = id;
   save(); setOrder(); buildChips(); render();
   if (rehome) {
     const chip = document.querySelector("#decks .chip.on");
