tests/mutants/d_save_no_guard.patch
# kills: a throwing localStorage breaks neither boot nor navigation
# suite: node --test --test-name-pattern ^a.throwing.localStorage.breaks.neither.boot.nor.navigation$ tests/app.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -5495,13 +5495,11 @@ const deck = () => CUSTOM[deckId] || DECKS.find(d => d.id === deckId) || DECKS[0
 // READ-MODIFY-WRITE: "hpfc" is one object shared with whatever else stores
 // settings there, so writing our two keys must not drop a sibling's.
 const save = () => {
-  try {
-    const base = readStore(STORE_KEY);
-    const next = (base && typeof base === "object" && !Array.isArray(base)) ? base : {};
-    next.deck = storedDeck;
-    next.mode = mode;
-    next.printPaper = printPaper;
-    localStorage.setItem(STORE_KEY, JSON.stringify(next));
-  } catch (e) {}
+  const base = readStore(STORE_KEY);
+  const next = (base && typeof base === "object" && !Array.isArray(base)) ? base : {};
+  next.deck = storedDeck;
+  next.mode = mode;
+  next.printPaper = printPaper;
+  localStorage.setItem(STORE_KEY, JSON.stringify(next));
 };

 /* ---------------- generated decks ---------------- */
