tests/mutants/d_save_regenerates_twice.patch
# kills: saving from the Edit sheet regenerates exactly once (13A)
# suite: node --test --test-name-pattern ^saving.from.the.Edit.sheet.regenerates.exactly.once..13A.$ tests/app.test.js
diff --git a/index.html b/index.html
index 3509543..cc59021 100644
--- a/index.html
+++ b/index.html
@@ -3472,6 +3472,7 @@ function runGenerate() {
   // deck"), nor on an options-only edit or an unchanged re-save (the id does
   // not move), nor on a field edit to a scale no other deck holds.
   let taken = null;
+  generateDeck(String(scaleBox.value || ""), sheetOptions());
   const res = generateDeck(String(scaleBox.value || ""), sheetOptions(), (seed) => {
     if (!wasId) return null;
     const id = HPE.core.deckId(seed.fields);
