tests/mutants/d_save_wholesale.patch
# kills: writing the app's own keys leaves a sibling key in hpfc untouched
# suite: node --test --test-name-pattern ^writing.the.app.s.own.keys.leaves.a.sibling.key.in.hpfc.untouched$ tests/app.test.js
# save() goes back to replacing the whole hpfc object, so any sibling key
# another feature stored there is silently dropped on the next write.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -5496,12 +5496,7 @@ const deck = () => CUSTOM[deckId] || DECKS.find(d => d.id === deckId) || DECKS[0
 // settings there, so writing our two keys must not drop a sibling's.
 const save = () => {
   try {
-    const base = readStore(STORE_KEY);
-    const next = (base && typeof base === "object" && !Array.isArray(base)) ? base : {};
-    next.deck = storedDeck;
-    next.mode = mode;
-    next.printPaper = printPaper;
-    localStorage.setItem(STORE_KEY, JSON.stringify(next));
+    localStorage.setItem(STORE_KEY, JSON.stringify({deck: storedDeck, mode, printPaper}));
   } catch (e) {}
 };
 
