tests/mutants/d_scales_trusts_record.patch
# kills: a corrupt saved scale is dropped and the app still boots on the built-ins
# suite: node --test --test-name-pattern ^a.corrupt.saved.scale.is.dropped.and.the.app.still.boots.on.the.built.ins$ tests/app.test.js
# restoreScales trusts whatever is in storage, so one unusable record throws
# and takes the whole boot down with it.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -2482,8 +2482,6 @@ function rememberScale(seed) {
 function restoreScales() {
   for (const rec of savedScales()) {
     try {
-      if (!rec || typeof rec !== "object" || typeof rec.s !== "string") continue;
-      if (!checkShareVersion(rec.v).ok) continue;
       generateDeck(rec.s, rec.o || undefined);
     } catch (e) {}
   }
