tests/mutants/d_share_version_lax.patch
# kills: the share version guard rejects a newer payload with NEEDS_NEWER_APP
# The Phase 4 guard accepts one version above the running app, so a PWA-cached
# old index.html would misread a newer link instead of rejecting it.
diff --git a/index.html b/index.html
index b018e51..92f1ab0 100644
--- a/index.html
+++ b/index.html
@@ -2436,7 +2436,7 @@ function checkShareVersion(v) {
     return { ok: false, code: "BAD_NOTE",
              reason: HPE.core.REASONS.BAD_NOTE.reason.split("<X>").join(String(v).slice(0, 12)) };
   }
-  return v > SHARE_VERSION ? engineErr("NEEDS_NEWER_APP") : { ok: true, value: v };
+  return v > SHARE_VERSION + 1 ? engineErr("NEEDS_NEWER_APP") : { ok: true, value: v };
 }
 
 // D14: what travels is the SEED, never the generated deck, so an old link
