tests/mutants/d_sheet_backdrop_any_click.patch
# kills: a tap on the backdrop closes the sheet; a tap inside it does not
# Any click that reaches the layer closes the sheet, so typing into the box
# or picking a palette dismisses the work in progress.
diff --git a/index.html b/index.html
index 16984c6..73d0986 100644
--- a/index.html
+++ b/index.html
@@ -2443,7 +2443,7 @@ mirrorR.onclick = () => setMirror(false);
 scaleBox.addEventListener("input", updateParse);
 scaleBox.addEventListener("keydown", e => { if (e.key === "Enter") { e.preventDefault(); runGenerate(); } });
 // A tap whose target IS the layer is a tap on the backdrop, never on the sheet.
-sheet.addEventListener("click", e => { if (e.target === sheet) closeScaleSheet(); });
+sheet.addEventListener("click", e => { closeScaleSheet(); });
 // Tab is trapped inside: the sheet's own controls, in visual order.
 sheet.addEventListener("keydown", e => {
   if (e.key !== "Tab") return;
