tests/mutants/d_sheet_focus_stays.patch
# kills: the deck row ends with a + ADD chip that opens the sheet, focusing the box
# suite: node --test --test-name-pattern ^the.deck.row.ends.with.a...ADD.chip.that.opens.the.sheet..focusing.the.box$ tests/app.test.js
# The sheet opens but focus is left on the + ADD chip, so a keyboard or
# screen-reader user lands outside the modal they just opened.
diff --git a/index.html b/index.html
index a127d86..7206c19 100644
--- a/index.html
+++ b/index.html
@@ -2866,7 +2866,6 @@ function showSheet(opener) {
   sheetOpen = true;
   for (const el of background) { el.inert = true; el.setAttribute("aria-hidden", "true"); }
   updateParse();
-  scaleBox.focus();
 }
 // The create path. Everything is reset, so an Edit never leaks its seed, its
 // palette or its mirror into the next "+ ADD".
