tests/mutants/d_sheet_focus_stays.patch
# kills: the deck row opens with a + ADD chip that opens the page, focusing BACK
# suite: node --test --test-name-pattern ^the.deck.row.opens.with.a...ADD.chip.that.opens.the.page..focusing.BACK$ tests/app.test.js
# The page opens with focus in the seed box again, which is what the owner
# asked to be removed: the soft keyboard covers the page before it has been
# read once.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4577,7 +4577,7 @@
   // to BACK. A button, so no keyboard opens; a real tab stop, so it does not
   // need a tabindex that outlives the page; and first in reading order, so Tab
   // from there walks the page the way it looks.
-  backBtn.focus();
+  scaleBox.focus();
 }
 // The create path. Everything is reset, so an Edit never leaks its seed, its
 // palette or its mirror into the next "+ ADD".
