tests/mutants/d_unarmed_tap_rederives_the_sheet.patch
# kills: an ordinary tap in the sheet says nothing, so it cannot wipe what was said
# suite: node --test --test-name-pattern ^an.ordinary.tap.in.the.sheet.says.nothing..so.it.cannot.wipe.what.was.said$ tests/app.test.js
# disarmDelete() runs on EVERY pointerdown in the sheet, so without the early
# return the half of it that takes the warning down re-derives the whole sheet
# from the seed on taps that cancelled nothing. A pan-wide warning is read off
# the deck at open time and is NOT derivable from the seed, so an ordinary tap
# on the seed field erases it for good.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4940,7 +4940,6 @@
   /* Nothing to undo when nothing is armed, and re-deriving anyway would be
      worse than silent: this runs on every pointerdown in the sheet, so an
      unguarded disarm would re-parse the seed on taps that cancelled nothing. */
-  if (!delArmed) return;
   delArmed = false;
   delBtn.textContent = DEL_IDLE;
   delBtn.removeAttribute("data-armed");
