tests/mutants/d_unarmed_tap_wipes_the_message.patch
# kills: an ordinary unarmed tap does not wipe a collision refusal (queue row 91 guard)
# suite: node --test --test-name-pattern ^an.ordinary.unarmed.tap.does.not.wipe.a.collision.refusal..queue.row.91.guard.$ tests/e2e.test.js
# Every pointerdown in the sheet re-runs updateParse() instead of disarming,
# armed or not. That is harmless for a syntactically bad seed (updateParse()
# re-derives the identical rejection), but a collision refusal is bad for a
# reason parseSeed knows nothing about: the seed itself still parses fine, and
# updateParse() clears the standing refusal by design. An ordinary tap while
# DELETE was never armed then wrongly drops .bad and wipes "Another deck
# already uses this scale." for an edit that was never fixed.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4990,7 +4990,7 @@
    owner's device actually makes. The pointerdown that lands ON the button is
    not: it is the confirming tap's own first half. */
 sheet.addEventListener("pointerdown", (e) => {
-  if (e.target !== delBtn) disarmDelete();
+  if (e.target !== delBtn) updateParse();
 });  // disarmDelete() is a no-op unless armed, so an ordinary tap writes nothing.
 delBtn.onblur = disarmDelete;
 // The mirror is the choice the pan preview exists to make visible, so each
