tests/mutants/e_a11y_both_faces_exposed.patch
# kills: only the face that is showing is exposed, and the counter is a live region
# suite: node --test --test-name-pattern only.the.face.that.is.showing.is.exposed tests/e2e.test.js
# Both faces stay in the accessibility tree, so the card reads out the question
# and its answer together and flipping changes nothing.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4412,26 +4412,6 @@ function render() {
   // out alongside the question. Expose only the face that is showing, and make
   // it the card's description (descendants of role="button" are presentational,
   // so the text has to reach the button by an idref, not by traversal).
-  const shown = document.getElementById(flipped ? "back" : "front");
-  const away  = document.getElementById(flipped ? "front" : "back");
-  away.setAttribute("aria-hidden", "true");
-  shown.removeAttribute("aria-hidden");
-  // aria-hidden alone does not remove a link from the tab order, and
-  // headerHTML() renders .prints into BOTH faces - so a keyboard user would
-  // tab into two invisible links, and a screen reader would meet focusable
-  // content inside an aria-hidden subtree.
-  // Scoped through document, not through the face element: the face is the
-  // node whose innerHTML was just replaced, and the unit suite's DOM stub
-  // serves selectors from the document only.
-  // Widened past `.prints a` for the custom path: a generated deck's controls
-  // are <button> and <select>, and an unwidened selector would leave THREE
-  // focusable controls inside an aria-hidden subtree - the exact defect this
-  // pair of lines was written to prevent, in new element types (AC-B1b).
-  const printCtrls = (id) =>
-    ["a", "button", "select"].map((t) => `#${id} .prints ${t}`).join(",");
-  for (const el of document.querySelectorAll(printCtrls(away.id))) el.tabIndex = -1;
-  for (const el of document.querySelectorAll(printCtrls(shown.id))) el.removeAttribute("tabindex");
-  cardEl.setAttribute("aria-describedby", shown.id);
 }
 
 /* ---------------- deck / order ---------------- */
