tests/mutants/e_a11y_chip_no_aria_current.patch
# kills: the selected deck and the active mode carry accessible state
# suite: node --test --test-name-pattern the.selected.deck.and.the.active.mode.carry.accessible.state tests/e2e.test.js
# The selected deck chip goes back to signalling itself with colour alone, so
# a screen reader cannot tell which deck is loaded.
diff --git a/index.html b/index.html
index 140fa68..6906363 100644
--- a/index.html
+++ b/index.html
@@ -3637,7 +3637,6 @@ function buildChips() {
     b.className = "chip" + (d.id === deckId ? " on" : "");
     // Same rule as the mode bar: the .on colour is not state a screen reader
     // can see, so the selected chip says so out loud.
-    if (d.id === deckId) b.setAttribute("aria-current", "true");
     b.style.setProperty("--dga", d.colors.ga);
     b.style.setProperty("--dgb", d.colors.gb);
     // [row 218] The one chip with a SECOND action says so. A selected custom
