tests/mutants/e_a11y_mode_pressed_frozen.patch
# kills: the selected deck and the active mode carry accessible state
# suite: node --test --test-name-pattern the.selected.deck.and.the.active.mode.carry.accessible.state tests/e2e.test.js
# setMode() paints the .on colour but stops updating aria-pressed, so the mode
# bar reports whatever the markup shipped with no matter which mode is live.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -3857,7 +3857,6 @@ function setMode(m) {
   for (const [id, on] of [["modeA", m === "A"], ["modeB", m === "B"]]) {
     const el = document.getElementById(id);
     el.classList.toggle("on", on);
-    el.setAttribute("aria-pressed", on ? "true" : "false");
   }
   render();
 }
