tests/mutants/e_add_chip_unpinned.patch
# kills: + ADD is fully on-screen and hit-testable at phone widths
# + ADD goes back to flowing at the end of the deck strip instead of being
# pinned to its right edge, which is the owner-reported bug: with the three
# built-in decks the strip already overflows a phone, so the only entry point
# to the create sheet and the pan preview starts at x=416 - off-screen at 380,
# 390 and 430 CSS px alike, and only visible from 768px up.
diff --git a/index.html b/index.html
index f44c129..32f0337 100644
--- a/index.html
+++ b/index.html
@@ -67,7 +67,7 @@ h1{font-family:Marcellus, serif; font-weight:400; font-size:clamp(20px,5.5vw,27p
      view") stops short of it. */
 #decks{--addpin:max(22px, env(safe-area-inset-right));
   scroll-padding-right:calc(74px + var(--addpin))}
-#deck-add{position:sticky; right:var(--addpin); margin-left:var(--addpin);
+#deck-add{position:relative; right:var(--addpin); margin-left:var(--addpin);
   z-index:1; background:var(--table2);
   box-shadow:-14px 0 10px -4px var(--table2)}
 .chip .dot{display:inline-block; width:9px; height:9px; border-radius:50%;
