tests/mutants/e_add_pin_hides_chips.patch
# kills: pinning + ADD leaves every deck chip reachable at 380px
# The strip stops reserving room for the pinned + ADD chip, so the minimum
# scroll that brings a deck chip into view parks it directly UNDERNEATH the
# pin. The chip is then on-screen but untappable - the pin has traded one
# unreachable control for another.
diff --git a/index.html b/index.html
index f44c129..0c47a81 100644
--- a/index.html
+++ b/index.html
@@ -66,7 +66,7 @@ h1{font-family:Marcellus, serif; font-weight:400; font-size:clamp(20px,5.5vw,27p
      that gap, so scrollIntoView (and the app's own "keep the active chip in
      view") stops short of it. */
 #decks{--addpin:max(22px, env(safe-area-inset-right));
-  scroll-padding-right:calc(74px + var(--addpin))}
+  scroll-padding-right:0}
 #deck-add{position:sticky; right:var(--addpin); margin-left:var(--addpin);
   z-index:1; background:var(--table2);
   box-shadow:-14px 0 10px -4px var(--table2)}
