tests/mutants/e_chip_pencil_off_the_chip.patch
# kills: tapping the pencil opens the Edit sheet, from the glyph itself
# suite: node --test --test-name-pattern ^tapping.the.pencil.opens.the.Edit.sheet,.from.the.glyph.itself$ tests/e2e.test.js
# The glyph is painted off the chip (the classic off-screen absolute), so the
# pixel the owner sees and the pixel that opens Edit are no longer the same
# pixel: a tap at the glyph's centre lands outside the chip entirely. Every
# rect in the DOM still looks correct, which is why the test taps the point.
diff --git a/index.html b/index.html
index 4706826..c20799d 100644
--- a/index.html
+++ b/index.html
@@ -175,7 +175,7 @@ h1{font-family:Marcellus, serif; font-weight:400; font-size:clamp(20px,5.5vw,27p
    Row 262 is why it appears nowhere else: any affordance on a NON-selected
    chip invites a fix that opens Edit from one, and deleteDeck still drops
    focus to <body> on that path. */
-.chip .pencil{margin-left:6px; font-size:12px; line-height:1; opacity:.85}
+.chip .pencil{position:absolute; left:-9999px; font-size:12px; line-height:1; opacity:.85}
 .chip .dot{display:inline-block; width:9px; height:9px; border-radius:50%;
   margin-right:6px; vertical-align:-1px; background:linear-gradient(180deg,var(--dga) 0 50%,var(--dgb) 50% 100%)}
 .chip.on{color:#fff; border-image:linear-gradient(180deg,var(--dga) 0 50%,var(--dgb) 50% 100%) 1;
