tests/mutants/e_chip_pencil_off_the_chip.patch
# kills: tapping the pencil opens the Edit sheet, from the glyph itself
# suite: node --test --test-name-pattern ^tapping.the.pencil.opens.the.Edit.sheet,.from.the.glyph.itself$ tests/e2e.test.js
# The glyph is painted off the chip (the classic off-screen absolute). The
# computed ::after content still reads as a pencil and the chip still opens
# Edit when tapped anywhere - what is gone is the glyph's BOX on the chip, so
# the owner sees the same undifferentiated pill row 218 was filed about. The
# test measures that box (the width the chip loses when .editable comes off)
# rather than believing the content string, which is why it notices.
diff --git a/index.html b/index.html
index 140fa68..731f0d1 100644
--- a/index.html
+++ b/index.html
@@ -178,7 +178,7 @@ h1{font-family:Marcellus, serif; font-weight:400; font-size:clamp(20px,5.5vw,27p
    Row 262 is why it appears nowhere else: any affordance on a NON-selected
    chip invites a fix that opens Edit from one, and deleteDeck still drops
    focus to <body> on that path. */
-.chip.editable::after{content:"\270E"; margin-left:6px; font-size:12px; line-height:1;
+.chip.editable::after{content:"\270E"; position:absolute; left:-9999px; font-size:12px; line-height:1;
   opacity:.85}
 .chip .dot{display:inline-block; width:9px; height:9px; border-radius:50%;
   margin-right:6px; vertical-align:-1px; background:linear-gradient(180deg,var(--dga) 0 50%,var(--dgb) 50% 100%)}
