tests/mutants/e_chip_pencil_on_builtins.patch
# kills: a selected custom chip carries a pencil; no built-in chip ever does
# suite: node --test --test-name-pattern ^a.selected.custom.chip.carries.a.pencil;.no.built.in.chip.ever.does$ tests/e2e.test.js
# The pencil drops its CUSTOM half and appears on any SELECTED chip, built-ins
# included. A selected built-in does nothing at all when tapped, so the glyph
# promises an Edit sheet that never opens - the affordance becomes a lie on
# three of the four chips, which is worse than row 218's original silence.
diff --git a/index.html b/index.html
index 4706826..ab297f0 100644
--- a/index.html
+++ b/index.html
@@ -3624,7 +3624,7 @@ function buildChips() {
     // (aria-hidden) and the accessible name carries the same fact in words.
     // Only ever on the chip that is BOTH selected and custom: row 262 is a
     // live focus trap on any path that opens Edit from an unselected chip.
-    const editable = d.id === deckId && !!CUSTOM[d.id];
+    const editable = d.id === deckId;
     b.innerHTML = `<span class="dot"></span>${esc(chipLabel(d.name))}` +
       (editable ? `<span class="pencil" aria-hidden="true">&#9998;</span>` : "");
     if (editable) b.setAttribute("aria-label", "Edit " + d.name);
