tests/mutants/e_collision_silent.patch
# kills: an edit onto another deck's scale is refused at 380px and both chips stay
# suite: node --test --test-name-pattern ^an.edit.onto.another.deck.s.scale.is.refused.at.380px.and.both.chips.stay$ tests/e2e.test.js
diff --git a/index.html b/index.html
index 3509543..16ee488 100644
--- a/index.html
+++ b/index.html
@@ -3487,7 +3487,7 @@ function runGenerate() {
     // section 2 code enum is closed and has no code for "that scale is taken",
     // so this composes no sentence that could pass for one and carries no code.
     scaleBox.classList.add("bad");
-    say("Another deck already uses this scale.", "err");
+    say("", "err");
     return;
   }
   if (!res.ok) {
