tests/mutants/e_collision_silent.patch
# kills: an edit onto another deck's scale is refused at 380px and both chips stay
# suite: node --test --test-name-pattern ^an.edit.onto.another.deck.s.scale.is.refused.at.380px.and.both.chips.stay$ tests/e2e.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -5032,7 +5032,7 @@ function runGenerate() {
     // so this composes no sentence that could pass for one and carries no code.
     scaleBox.classList.add("bad");
     refusal = "Another deck already uses this scale.";
-    showRefusal(refusal);
+    showRefusal("");
     return;
   }
   if (!res.ok) {
