tests/mutants/e_deck_order.patch
# kills: deck chips switch the deck
# suite: node --test --test-name-pattern ^deck.chips.switch.the.deck$ tests/e2e.test.js
diff --git a/index.html b/index.html
index 7ea4e13..f2be039 100644
--- a/index.html
+++ b/index.html
@@ -3003,7 +3003,7 @@ function selectDeck(id) {
     (a.id === "deck-add" || !!(a.closest && a.closest("#decks")));
   deckId = id;
   storedDeck = id;
-  save(); setOrder(); buildChips(); render();
+  save(); buildChips(); render();
   if (rehome) {
     const chip = document.querySelector("#decks .chip.on");
     if (chip) chip.focus();
