tests/mutants/e_edit_backdrop_ignored.patch
# kills: a backdrop tap closes the Edit sheet
# suite: node --test --test-name-pattern ^a.backdrop.tap.closes.the.Edit.sheet$ tests/e2e.test.js
diff --git a/index.html b/index.html
index a127d86..fa3e2ad 100644
--- a/index.html
+++ b/index.html
@@ -2972,7 +2972,7 @@ nameBox.addEventListener("input", updateParse);
 degSel.addEventListener("change", updateParse);
 scaleBox.addEventListener("keydown", e => { if (e.key === "Enter") { e.preventDefault(); runGenerate(); } });
 // A tap whose target IS the layer is a tap on the backdrop, never on the sheet.
-sheet.addEventListener("click", e => { if (e.target === sheet) closeScaleSheet(); });
+sheet.addEventListener("click", e => { if (e.target === sheet && !editingId) closeScaleSheet(); });
 // Tab is trapped inside: the sheet's own controls, in visual order.
 sheet.addEventListener("keydown", e => {
   if (e.key !== "Tab") return;
