tests/mutants/e_edit_focus_to_add.patch
# kills: Escape closes the Edit sheet and focus returns to the chip that opened it
# suite: node --test --test-name-pattern ^Escape.closes.the.Edit.sheet.and.focus.returns.to.the.chip.that.opened.it$ tests/e2e.test.js
# Every close hands focus to + ADD, so leaving an Edit page drops the keyboard
# user at the end of the chip strip instead of on the chip they came from.
diff --git a/index.html b/index.html
index 2e7df19..62bb599 100644
--- a/index.html
+++ b/index.html
@@ -4787,7 +4787,7 @@ function hideSheet() {
   }
   editingId = null;
   for (const el of background) { el.inert = false; el.removeAttribute("aria-hidden"); }
-  (sheetOpener || addChip).focus();
+  addChip.focus();
   sheetOpener = null;
 }
 // The app's own way out: BACK, Escape, or a save that finishes. It pops the
