tests/mutants/e_edit_forks_chip.patch
# kills: a field edit leaves one chip for the deck, selected and relabelled, at 380px
# suite: node --test --test-name-pattern ^a.field.edit.leaves.one.chip.for.the.deck..selected.and.relabelled..at.380px$ tests/e2e.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -3404,7 +3404,6 @@ function runGenerate() {
   // and the new one takes its chip position. An options-only edit never gets
   // here - the id is unchanged and generateDeck already replaced it in place.
   const replaced = !!wasId && d.id !== wasId;
-  if (replaced) replaceRegistered(wasId, d);
   // [eng-review 2, 2A] the warnings are read off the deck the SAME generation
   // produced; nothing is rebuilt to re-derive them.
   const warned = (d.warnings || []).map(w => w.reason);
