tests/mutants/e_edit_name_ignored.patch
# kills: renaming from the Edit sheet relabels the chip
diff --git a/index.html b/index.html
index 8a5bb64..cac6fb7 100644
--- a/index.html
+++ b/index.html
@@ -3259,7 +3259,6 @@ function sheetOptions() {
     // row 73). autoName has ONE producer, in select.js; this only compares.
     const d = editedDeck();
     const auto = d ? HPE.select.autoName(d.fields, d.options.parent) : null;
-    if (n && n !== auto) o.name = n;  // validated by core.parseSeed, never here
     if (layoutOrder) o.order = layoutOrder.slice();
   }
   return o;
