tests/mutants/e_edit_name_ignored.patch
# kills: renaming from the Edit sheet relabels the chip
# suite: node --test --test-name-pattern ^renaming.from.the.Edit.sheet.relabels.the.chip$ tests/e2e.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -3329,7 +3329,6 @@ function sheetOptions() {
     // that already carries an EXPLICIT name keeps it either way.
     const d = editedDeck();
     const kept = !!(d && d.options && d.options.name);
-    if (n && (nameDirty || kept)) o.name = n;  // validated by core.parseSeed, never here
     if (layoutOrder) o.order = layoutOrder.slice();
   }
   return o;
