tests/mutants/e_edit_tab_skips_delete.patch
# kills: Tab is trapped inside the Edit sheet and reaches every Edit control
# suite: node --test --test-name-pattern ^Tab.is.trapped.inside.the.Edit.sheet.and.reaches.every.Edit.control$ tests/e2e.test.js
diff --git a/index.html b/index.html
index f27316d..ce59480 100644
--- a/index.html
+++ b/index.html
@@ -3414,8 +3414,7 @@ sheet.addEventListener("keydown", e => {
                  editingId ? resetBtn : null,
                  editingId ? slotsBox.children[layoutSel] : null,
                  editingId ? moveL : null, editingId ? moveR : null,
-                 mirrorL, mirrorR, ...swatches.children, genBtn,
-                 editingId ? delBtn : null]
+                 mirrorL, mirrorR, ...swatches.children, genBtn]
     .filter(el => el && !el.disabled);
   const i = stops.indexOf(document.activeElement);
   const next = e.shiftKey ? (i <= 0 ? stops.length - 1 : i - 1) : (i === stops.length - 1 ? 0 : i + 1);
