tests/mutants/e_empty_box_drops_the_pan.patch
# kills: the only height the first keystroke changes is the hint's own wrap
# suite: node --test --test-name-pattern ^the.only.height.the.first.keystroke.changes.is.the.hint.s.own.wrap$ tests/e2e.test.js
# An empty box shows no pan again, so the plate enters the flow on the first
# keystroke and the drawer jumps by the height of the whole plate.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4687,7 +4687,7 @@ function syncParseState({ paint }) {
     showParse(PARSE_HINT);
     scaleBox.classList.remove("bad");
     genBtn.disabled = true;
-    if (paint) showPlaceholderPan();
+    if (paint) clearPanPreview();
     say("", "");
     return;
   }
