tests/mutants/e_flip_transform.patch
# kills: tapping the card flips it
# suite: node --test --test-name-pattern ^tapping.the.card.flips.it$ tests/e2e.test.js
# Regenerated, not rewritten: the mutation is the same one this patch has always
# made (delete the .card.flip transform), but it carried the old
# `.scene{width:var(--card-w); ...}` line as hunk CONTEXT, and the landscape
# card-fit fix rewrote exactly that line - so the patch went stale and the
# sweep reported it as a survivor. Re-cut against the current index.html with
# real hashes; the removed and added lines are byte-identical to before.
diff --git a/index.html b/index.html
index 810ab84..ee12771 100644
--- a/index.html
+++ b/index.html
@@ -109,7 +109,7 @@ main{flex:1; display:flex; align-items:center; justify-content:center; width:100
   aspect-ratio:63/87; perspective:1400px}
 .card{position:relative; width:100%; height:100%; transform-style:preserve-3d;
   transition:transform .45s cubic-bezier(.2,.7,.25,1); cursor:pointer}
-.card.flip{transform:rotateY(180deg)}
+/* .card.flip transform rule deleted */
 @media (prefers-reduced-motion: reduce){ .card{transition:none} }
 .face{position:absolute; inset:0; backface-visibility:hidden; -webkit-backface-visibility:hidden;
   background:var(--paper); border-radius:12px; overflow:hidden;
