tests/mutants/e_focus_not_returned.patch
# kills: Escape closes the sheet and focus returns to + ADD
# suite: node --test --test-name-pattern ^Escape.closes.the.sheet.and.focus.returns.to...ADD$ tests/e2e.test.js
# Closing the page leaves focus on whatever was inside it, which is detached
# the moment the page hides - so the keyboard user lands on <body> and has to
# tab from the top of the document to get back to where they were.
diff --git a/index.html b/index.html
index 2e7df19..cd31692 100644
--- a/index.html
+++ b/index.html
@@ -4787,7 +4787,8 @@ function hideSheet() {
   }
   editingId = null;
   for (const el of background) { el.inert = false; el.removeAttribute("aria-hidden"); }
-  (sheetOpener || addChip).focus();
+
+
   sheetOpener = null;
 }
 // The app's own way out: BACK, Escape, or a save that finishes. It pops the
