tests/mutants/e_focus_not_returned.patch
# kills: Escape closes the sheet and focus returns to + ADD
# suite: node --test --test-name-pattern ^Escape.closes.the.sheet.and.focus.returns.to...ADD$ tests/e2e.test.js
# Closing the page leaves focus on whatever was inside it, which is detached
# the moment the page hides - so the keyboard user lands on <body> and has to
# tab from the top of the document to get back to where they were.
diff --git a/index.html b/index.html
index 79d9295..09b08ea 100644
--- a/index.html
+++ b/index.html
@@ -4705,7 +4705,7 @@ function hideSheet() {
   if (sheetSurf) sheetSurf.style.transform = "";
   editingId = null;
   for (const el of background) { el.inert = false; el.removeAttribute("aria-hidden"); }
-  (sheetOpener || addChip).focus();
+
   sheetOpener = null;
 }
 // The app's own way out: BACK, Escape, or a save that finishes. It pops the
