tests/mutants/e_kb_sheet_never_translates.patch
# kills: with a real keyboard up, the seed box is not clipped by the sheet's own scroller
# suite: node --test --test-name-pattern ^with.a.real.keyboard.up..the.seed.box.is.not.clipped.by.the.sheet.s.own.scroller$ tests/e2e.test.js
# The sheet never lifts out from under the keyboard. The seed box still has a
# laid-out box inside .sheetbody, so an oracle that clips at innerHeight scores
# it fully visible while the owner sees the keyboard sitting on top of it.
diff --git a/index.html b/index.html
index 2e7df19..cf8be9d 100644
--- a/index.html
+++ b/index.html
@@ -4662,7 +4662,7 @@ function applyKbOffset() {
   /* Written only on change: this handler is bound to visualViewport's `scroll`
    * as well, which fires at frame rate while a zoomed page is panned, and each
    * unconditional style write forces a style recalc for no reason. */
-  const t = off > 0 ? `translateY(-${off}px)` : "";
+  const t = "";
   const m = cap > 0 ? `${cap}px` : "";
   if (sheetSurf.style.transform !== t) sheetSurf.style.transform = t;
   if (sheetSurf.style.maxHeight !== m) sheetSurf.style.maxHeight = m;
