tests/mutants/e_landscape_card_overflows_main.patch
# kills: in landscape every control stays tappable and the card fits, at every size and state
# suite: node --test --test-name-pattern ^in.landscape.every.control.stays.tappable.and.the.card.fits..at.every.size.and.state$ tests/e2e.test.js
# Puts the card's size constraint back the way round it used to be: --card-w as
# the WIDTH, with aspect-ratio 63/87 deriving the height from it. That is a
# one-way constraint, and in landscape the HEIGHT is the axis that runs out - at
# 844x390 `main` has 113.8px to give while 46vh asks for a 179.4-wide card, so a
# 247.7-tall one. align-items:center splits the ~134px of overflow above and
# below, and the card lies over the header and the footer: elementFromPoint at
# the centre of #modeA, #modeB, .shuffle and .count returns .prompt, and at
# #deck-add returns the card's own .hdr. Every one of those rects stays fully
# on-screen and correctly sized throughout, so only the hit-test sees it.
# Re-cut 2026-09-15 (lane w43b): the .card rule two lines down gained a
# border-radius - the press ring follows the card's corners now - and this
# patch carried that line as hunk CONTEXT, so it went stale. The mutation
# itself is byte-identical to before.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -290,8 +290,7 @@ main{flex:1; display:flex; align-items:center; justify-content:center; width:100
    every viewport, portrait included. Every control hit-tests clean with no card
    on the page - which is why the test asserts the card is MAXIMAL, not merely
    contained. */
-.scene{height:min(100%, calc(var(--card-w) * 87 / 63)); width:auto; max-width:100%;
-  aspect-ratio:63/87; perspective:1400px}
+.scene{width:var(--card-w); aspect-ratio:63/87; perspective:1400px}
 .card{position:relative; width:100%; height:100%; transform-style:preserve-3d;
   transition:transform .45s cubic-bezier(.2,.7,.25,1); cursor:pointer;
   /* The 12px radius lives on .face, but .card:active's ring is a box-shadow
