tests/mutants/e_launch_failure_orphans.patch
# kills: a launch() that fails after spawn leaves no browser and no profile
# suite: node --test --test-name-pattern ^a.launch...that.fails.after.spawn.leaves.no.browser.and.no.profile$ tests/e2e.test.js
# launch() rethrows a post-spawn failure without reaping, so every failed
# launch orphans a browser process and an hpfc-prof-* directory.
diff --git a/tests/helpers/cdp.js b/tests/helpers/cdp.js
index e6888ee..833f854 100644
--- a/tests/helpers/cdp.js
+++ b/tests/helpers/cdp.js
@@ -254,7 +254,6 @@ async function launch() {
     return b;
   } catch (err) {
     try { if (ws) ws.close(); } catch {}
-    reap(entry);
     throw err;
   }
 }
