tests/mutants/e_layout_arrows_dead.patch
# kills: the arrow keys choose a position and MOVE swaps it with its neighbour
# suite: node --test --test-name-pattern ^the.arrow.keys.choose.a.position.and.MOVE.swaps.it.with.its.neighbour$ tests/e2e.test.js
# The arrow keys stop moving the selection, so the only way left to pick a
# note is a pointer - exactly the drag-only path D5 forbids.
diff --git a/index.html b/index.html
index 79d9295..bd53766 100644
--- a/index.html
+++ b/index.html
@@ -4846,8 +4846,8 @@ previewBox.addEventListener("click", (e) => {
 previewBox.addEventListener("keydown", (e) => {
   if (!editingId) return;
   let by;
-  if (e.key === "ArrowRight" || e.key === "ArrowDown") by = 1;
-  else if (e.key === "ArrowLeft" || e.key === "ArrowUp") by = -1;
+  if (e.key === "ArrowRight" || e.key === "ArrowDown") by = 0;
+  else if (e.key === "ArrowLeft" || e.key === "ArrowUp") by = 0;
   else if (e.key === "Home") by = "home";
   else if (e.key === "End") by = "end";
   else return;
