tests/mutants/e_layout_hint_not_drawn.patch
# kills: the LAYOUT hint is visible inside the group, not merely present in the file
# suite: node --test --test-name-pattern ^the.LAYOUT.hint.is.visible.inside.the.group..not.merely.present.in.the.file$ tests/e2e.test.js
# The hint is in the markup, correctly worded, inside the right group - and
# draws nothing. Every text-based oracle passes: the string is in index.html,
# it names all three gestures, and #scale-layout-row is not hidden. The owner
# opens the Edit page and still cannot tell what ROTATE and MOVE do, which is
# the entire complaint the stage exists to answer.
diff --git a/index.html b/index.html
index 3034159..9dac519 100644
--- a/index.html
+++ b/index.html
@@ -587,7 +587,7 @@ button.nav:active{background:#2e281e}
    label's letter-spaced caps - it is a sentence to read once, not a control
    label to scan. Dimmer than #scale-parse: that line reports on what is in the
    box and changes as you type, this one never changes. */
-.sheethint{margin:0; font-family:Bitter, serif; font-weight:400; font-size:11.5px;
+.sheethint{margin:0; display:none; font-family:Bitter, serif; font-weight:400; font-size:11.5px;
   line-height:1.5; color:#a79d8b; overflow-wrap:anywhere}
 #scale-layout-row .ctlrow{gap:var(--sp-2); flex-wrap:wrap}
 /* The selection ring is drawn in the SVG (pan(), .pansel) rather than in CSS:
