tests/mutants/e_layout_not_in_tab_trap.patch
# kills: Tab is trapped inside the Edit sheet and reaches every Edit control
# suite: node --test --test-name-pattern ^Tab.is.trapped.inside.the.Edit.sheet.and.reaches.every.Edit.control$ tests/e2e.test.js
# RESET drops out of the sheet's tab order, so a keyboard user can see the
# control but never reach it.
diff --git a/index.html b/index.html
index 574a311..64335da 100644
--- a/index.html
+++ b/index.html
@@ -3951,7 +3951,6 @@ sheet.addEventListener("keydown", e => {
   const stops = [editingId ? nameBox : null,
                  scaleBox, editingId ? degSel : null,
                  editingId ? rotL : null, editingId ? rotR : null,
-                 editingId ? resetBtn : null,
                  editingId ? slotsBox.children[layoutSel] : null,
                  editingId ? moveL : null, editingId ? moveR : null,
                  mirrorL, mirrorR, ...swatches.children, genBtn,
