tests/mutants/e_layout_not_in_tab_trap.patch
# kills: Tab is trapped inside the Edit sheet and reaches every Edit control
# suite: node --test --test-name-pattern ^Tab.is.trapped.inside.the.Edit.sheet.and.reaches.every.Edit.control$ tests/e2e.test.js
# RESET drops out of the page's tab order, so a keyboard user can see the
# control but never reach it.
diff --git a/index.html b/index.html
index 79d9295..3f052f5 100644
--- a/index.html
+++ b/index.html
@@ -4875,7 +4875,7 @@ sheet.addEventListener("keydown", e => {
                  editingId ? previewBox : null,
                  editingId ? rotL : null, editingId ? rotR : null,
                  editingId ? moveL : null, editingId ? moveR : null,
-                 editingId ? resetBtn : null,
+
                  editingId ? degSel : null,
                  mirrorL, mirrorR, ...swatches.children, genBtn,
                  editingId ? delBtn : null]
