tests/mutants/e_layout_rotate_inert.patch
# kills: ROTATE corrects the layout from the keyboard alone at 380px
# suite: node --test --test-name-pattern ^ROTATE.corrects.the.layout.from.the.keyboard.alone.at.380px$ tests/e2e.test.js
# ROTATE is wired to a zero shift, so the control focuses and presses and
# nothing on the pan moves.
diff --git a/index.html b/index.html
index f7b0bb9..b941e6c 100644
--- a/index.html
+++ b/index.html
@@ -3661,8 +3661,8 @@ delBtn.onclick = () => { if (editingId) deleteDeck(editingId); };
 // button re-solves the preview through the same parse path a keystroke uses.
 mirrorL.onclick = () => { setMirror(true); updateParse(); };
 mirrorR.onclick = () => { setMirror(false); updateParse(); };
-rotL.onclick = () => rotateLayout(-1);
-rotR.onclick = () => rotateLayout(1);
+rotL.onclick = () => rotateLayout(0);
+rotR.onclick = () => rotateLayout(0);
 moveL.onclick = () => moveNote(-1);
 moveR.onclick = () => moveNote(1);
 resetBtn.onclick = resetLayout;
