tests/mutants/e_layout_rotate_inert.patch
# kills: ROTATE makes its correction from the keyboard alone at 380px
# suite: node --test --test-name-pattern ^ROTATE.makes.its.correction.from.the.keyboard.alone.at.380px$ tests/e2e.test.js
# ROTATE is wired to a zero shift, so the control focuses and presses and
# nothing on the pan moves.
diff --git a/index.html b/index.html
index c9c2ab1..8d1d3d9 100644
--- a/index.html
+++ b/index.html
@@ -5021,8 +5021,8 @@ delBtn.onblur = disarmDelete;
 // button re-solves the preview through the same parse path a keystroke uses.
 mirrorL.onclick = () => { setMirror(true); resyncSheet(true); };
 mirrorR.onclick = () => { setMirror(false); resyncSheet(true); };
-rotL.onclick = () => rotateLayout(-1);
-rotR.onclick = () => rotateLayout(1);
+rotL.onclick = () => rotateLayout(0);
+rotR.onclick = () => rotateLayout(0);
 moveL.onclick = () => moveNote(-1);
 moveR.onclick = () => moveNote(1);
 resetBtn.onclick = resetLayout;
