tests/mutants/e_layout_slot_under_44.patch
# kills: every LAYOUT control is a 44px target with a visible focus ring
# suite: node --test --test-name-pattern ^every.LAYOUT.control.is.a.44px.target.with.a.visible.focus.ring$ tests/e2e.test.js
# The slot controls shrink under the 44px minimum, so on a phone the notes
# are too small to hit.
diff --git a/index.html b/index.html
index 574a311..cec0eb3 100644
--- a/index.html
+++ b/index.html
@@ -413,7 +413,7 @@ button.nav:active{background:#2e281e}
 #scale-layout-row{gap:var(--sp-2)}
 #scale-layout-row .ctlrow{gap:var(--sp-2)}
 #scale-slots{display:flex; flex-wrap:wrap; gap:var(--sp-2)}
-#scale-slots .slot{min-width:44px; min-height:44px; padding:6px 8px; cursor:pointer;
+#scale-slots .slot{min-width:24px; min-height:24px; padding:6px 8px; cursor:pointer;
   border:1px solid #433b2c; border-radius:8px; background:#151310; color:#c4bcab;
   font-family:Bitter, serif; font-weight:400; font-size:13px}
 #scale-slots .slot[aria-pressed="true"]{border-color:#f1ece1; color:#f1ece1}
