tests/mutants/e_optedit_reappends.patch
# kills: an options-only edit keeps its chip position across a reload at 380px
# suite: node --test --test-name-pattern ^an.options.only.edit.keeps.its.chip.position.across.a.reload.at.380px$ tests/e2e.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4810,7 +4810,8 @@ function runGenerate() {
   if (warned.length) text += " " + warned.join(" ");
 
   closeScaleSheet();
-  if (replaced) replaceScale(wasSeed, seedOf(d)); else rememberScale(seedOf(d));
+  if (replaced) replaceScale(wasSeed, seedOf(d));
+  else { if (wasSeed) forgetScale(wasSeed); rememberScale(seedOf(d)); }
   selectDeck(d.id);
   say(text, warned.length ? "warn" : "ok");
   genBtn.disabled = false;
