tests/mutants/e_page_background_still_announced.patch
# kills: the background behind the page is hidden from assistive tech, not only from the pointer
# suite: node --test --test-name-pattern ^the.background.behind.the.page.is.hidden.from.assistive.tech..not.only.from.the.pointer$ tests/e2e.test.js
# inert is set but aria-hidden is not. The background stops taking taps and tab
# stops, so every pointer and keyboard test still passes, while a screen reader
# reads straight through the open page into the practice screen behind it.
diff --git a/index.html b/index.html
index c9c2ab1..d50c80d 100644
--- a/index.html
+++ b/index.html
@@ -4753,7 +4753,7 @@ function showSheet(opener) {
   sheetOpener = opener || addChip;
   sheet.removeAttribute("hidden");
   sheetOpen = true;
-  for (const el of background) { el.inert = true; el.setAttribute("aria-hidden", "true"); }
+  for (const el of background) { el.inert = true; }
   resyncSheet(true);
   applyKbOffset();
   history.pushState({ scalePage: true }, "", sheetRoute());
