tests/mutants/e_parse_line_hugs_the_box.patch
# suite: node --test --test-name-pattern ^the.parse.line.sits.a.step.further.from.the.box.than.its.own.label$ tests/e2e.test.js
# kills: the parse line sits a step further from the box than its own label
# The parse line drops back to the label step, so what the box says and what
# comments on it bind equally tight and the reading order goes flat.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -355,7 +355,7 @@ button.nav:active{background:#2e281e}
    own line; this was the asymmetry. */
 #scale-parse{font-family:Bitter, serif; font-weight:400; font-size:12px; line-height:1.55;
   color:#c4bcab; overflow-wrap:anywhere;
-  margin-top:calc(var(--sp-2) - var(--sp-1)); min-height:1.55em}
+  margin-top:0; min-height:1.55em}
 /* The pan mock sits on a light plate because the pan is drawn in card ink -
    black rim, #242424 labels - and the sheet surface is dark. Capped so the
    whole sheet still fits a 380px phone without the preview pushing GENERATE
