tests/mutants/e_persist_save.patch
# kills: deck and mode survive a reload
# suite: node --test --test-name-pattern ^deck.and.mode.survive.a.reload$ tests/e2e.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -2396,15 +2396,7 @@ const deck = () => CUSTOM[deckId] || DECKS.find(d => d.id === deckId) || DECKS[0
 // from its saved seed, so restoring one is no longer a dangling reference.
 // READ-MODIFY-WRITE: "hpfc" is one object shared with whatever else stores
 // settings there, so writing our two keys must not drop a sibling's.
-const save = () => {
-  try {
-    const base = readStore(STORE_KEY);
-    const next = (base && typeof base === "object" && !Array.isArray(base)) ? base : {};
-    next.deck = storedDeck;
-    next.mode = mode;
-    localStorage.setItem(STORE_KEY, JSON.stringify(next));
-  } catch (e) {}
-};
+const save = () => {};
 
 /* ---------------- generated decks ---------------- */
 // Generation runs ONCE, here, at submit - never inside deck() or render()
