tests/mutants/e_preset_refusal_sticks.patch
# kills: an edit onto another deck's scale is refused at 380px and both chips stay
# suite: node --test --test-name-pattern ^an.edit.onto.another.deck.s.scale.is.refused.at.380px.and.both.chips.stay$ tests/e2e.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -3560,6 +3560,7 @@ function runGenerate() {
     // section 2 code enum is closed and has no code for "that scale is taken",
     // so this composes no sentence that could pass for one and carries no code.
     scaleBox.classList.add("bad");
+    scaleBox.removeEventListener("input", updateParse);
     say("Another deck already uses this scale.", "err");
     return;
   }
