tests/mutants/e_preset_writes_label.patch
# kills: a preset is one tap from a parsed scale and an auto-named deck at 380px
# suite: node --test --test-name-pattern ^a.preset.is.one.tap.from.a.parsed.scale.and.an.auto.named.deck.at.380px$ tests/e2e.test.js
diff --git a/index.html b/index.html
index 7e9b7f6..a49b96f 100644
--- a/index.html
+++ b/index.html
@@ -3179,7 +3179,7 @@ function buildSwatches() {
 // touches nameDirty, so the deck is auto-named by section 13 exactly as a typed
 // scale is - which keeps preset LABELS out of the deck-name space entirely.
 function applyPreset(p) {
-  scaleBox.value = p.seed;
+  scaleBox.value = p.label;
   // The same live parse a keystroke fires: the event the box already listens
   // for, never a second call to the parse logic from here.
   scaleBox.dispatchEvent(new Event("input", { bubbles: true }));
