tests/mutants/e_refusal_row_collapses.patch
# suite: node --test --test-name-pattern ^the.sheet.does.not.change.height.as.the.seed.is.typed$ tests/e2e.test.js
# kills: the sheet does not change height as the seed is typed
# The invalid branch stops writing the refusal, so the parse line (blanked one
# line above) and #scale-msg are BOTH empty, both :empty rules fire, and the
# shared row leaves the flow entirely - the sheet shrinks by a line on every
# invalid keystroke and #scale-parse + #scale-msg measure zero.
# Since 2026-09-21 the row is held open by CONTENT, not by a CSS floor:
# syncParseState() guarantees exactly one of the two carries text, so neither
# element's min-height is ever reachable and mutating either one is inert.
# This is the mutant the row's height rests on; a_msg_row_not_shared covers
# the other half of the design (the two sharing ONE line rather than two).
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4648,7 +4648,6 @@ function syncParseState({ paint }) {
     scaleBox.classList.add("bad");
     genBtn.disabled = true;
     if (paint) holdPanPreview();
-    say(res.reason, "err");
   }
 }
 
