tests/mutants/e_refusal_row_collapses.patch
# suite: node --test --test-name-pattern ^the.sheet.does.not.change.height.as.the.seed.is.typed$ tests/e2e.test.js
# kills: the sheet does not change height as the seed is typed
# showRefusal() blanks the parse line but never writes the refusal, so BOTH
# elements are empty, both :empty rules fire, and the shared row leaves the
# flow entirely - the sheet shrinks by a line on every invalid keystroke and
# #scale-parse + #scale-refusal measure zero together.
# The row is held open by CONTENT, not by a CSS floor: neither element's
# min-height is reachable behind :empty{display:none}, so mutating either
# declaration is inert and only the content can be mutated to prove the row
# is alive. Its sibling e_refusal_stacks_on_the_parse_line mutates the other
# direction (both filled at once), and a_msg_row_not_shared mutates the CSS
# that lets the two share ONE line rather than two.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4322,7 +4322,6 @@ function showRefusal(text) {
   // element's own rule. Cleared on the empty case so a hidden line is not
   // left holding a tier for whatever writes next.
   refusalLine.className = text ? "err" : "";
-  refusalLine.textContent = text;
 }
 
 /** The one adapter from a result/warning reason to a message tier. Warnings,
