tests/mutants/e_sheet_body_clips_instead_of_scrolling.patch
# kills: keeping the primary out of the scroll still leaves the sheet's own content reachable
# suite: node --test --test-name-pattern keeping.the.primary.out.of.the.scroll tests/e2e.test.js
# The sheet body still shrinks to leave the footer its place, and the primary
# still measures fine - but the part of the sheet that no longer fits is now
# clipped with no way for a finger to reach it: on a tall Edit sheet the LAYOUT
# row and the notes field become permanently unreachable, silently. An
# overflow:hidden box still accepts a scrollTop from SCRIPT, so this mutant is
# also the reason that test scrolls with a real wheel event.
diff --git a/index.html b/index.html
index f489642..493ded7 100644
--- a/index.html
+++ b/index.html
@@ -335,7 +335,7 @@ button.nav:active{background:#2e281e}
    with scrollWidth === clientWidth so there is not even a scrollbar to reach
    it. The negative margin gives the padding back to the layout, so nothing
    moves: the rows still align with the surface's own padding. */
-.sheetbody{overflow-y:auto; display:flex; flex-direction:column; gap:var(--sp-3);
+.sheetbody{overflow-y:hidden; display:flex; flex-direction:column; gap:var(--sp-3);
   padding-inline:var(--ring); margin-inline:calc(-1 * var(--ring))}
 /* A label, its control and the line that explains the control are ONE group:
    --sp-1 inside, and the group is separated from the next by .sheetbody. */
