tests/mutants/e_sheet_no_max_height.patch
# kills: the page is a modal dialog with the spec'd anatomy
# suite: node --test --test-name-pattern ^the.page.is.a.modal.dialog.with.the.spec.d.anatomy$ tests/e2e.test.js
# The page surface loses its viewport height and internal scroll, so it
# collapses to its content: the practice screen is covered by an opaque layer
# with a short box floating at the bottom, and a long page has no way to
# scroll to its primary.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -411,7 +411,7 @@
    between a label and the control it names - and the structure is unchanged
    apart from the height: header, scroll, reserved footer. */
 .sheetsurf{width:100%; max-width:520px; background:#1f1b15;
-  height:100dvh; max-height:100dvh; overflow-y:auto; overscroll-behavior:contain;
+  overscroll-behavior:contain;
   padding:var(--sp-3) var(--sp-4) max(var(--sp-4), env(safe-area-inset-bottom));
   display:flex; flex-direction:column; gap:var(--sp-4)}
 /* The header row: BACK, then the page title. Outside .sheetbody like the
