tests/mutants/e_sheet_not_inert.patch
# kills: while the sheet is open Generate is the only reachable primary button
# suite: node --test --test-name-pattern ^while.the.sheet.is.open.Generate.is.the.only.reachable.primary.button$ tests/e2e.test.js
# The landmarks behind the sheet stay live, so the modal is only visually
# modal: the practice screen's buttons remain clickable and focusable
# underneath it.
diff --git a/index.html b/index.html
index a127d86..d89a1e6 100644
--- a/index.html
+++ b/index.html
@@ -2864,7 +2864,6 @@ function showSheet(opener) {
   sheetOpener = opener || addChip;
   sheet.removeAttribute("hidden");
   sheetOpen = true;
-  for (const el of background) { el.inert = true; el.setAttribute("aria-hidden", "true"); }
   updateParse();
   scaleBox.focus();
 }
