tests/mutants/e_sheet_not_inert.patch
# kills: while the sheet is open Generate is the only reachable primary button
# suite: node --test --test-name-pattern ^while.the.sheet.is.open.Generate.is.the.only.reachable.primary.button$ tests/e2e.test.js
# The landmarks behind the page stay live, so the modal is only visually
# modal: the practice screen's buttons remain clickable and focusable
# underneath it.
diff --git a/index.html b/index.html
index c9c2ab1..6f6d0df 100644
--- a/index.html
+++ b/index.html
@@ -4753,7 +4753,7 @@ function showSheet(opener) {
   sheetOpener = opener || addChip;
   sheet.removeAttribute("hidden");
   sheetOpen = true;
-  for (const el of background) { el.inert = true; el.setAttribute("aria-hidden", "true"); }
+
   resyncSheet(true);
   applyKbOffset();
   history.pushState({ scalePage: true }, "", sheetRoute());
