tests/mutants/e_sheet_primary_back_in_the_scroll.patch
# kills: GENERATE CARDS is reachable without scrolling at every phone viewport
# suite: node --test --test-name-pattern GENERATE.CARDS.is.reachable.without.scrolling.at.every tests/e2e.test.js
# .sheetbody swallows the action cluster again, so the whole sheet scrolls as
# one and the primary - last in the flow - goes back below the fold: this is
# the reported bug verbatim (queue row 211), 245px down at 844x390.
diff --git a/index.html b/index.html
index 6a831d1..76d94a9 100644
--- a/index.html
+++ b/index.html
@@ -312,7 +312,6 @@ button.nav:active{background:#2e281e}
                 aria-label="Move the chosen note one position on">MOVE &rarr;</button>
       </div>
     </div>
-   </div>
     <!-- Outside .sheetbody, with the primary: the palette swatches carry their
          44px hit area as an invisible ::after overlay that is LARGER than the
          14px dot, and a scroll container would clip it (a scrolling box cannot
@@ -329,6 +328,7 @@ button.nav:active{background:#2e281e}
     <div class="editrow" id="scale-delete-row" hidden>
       <button id="scale-delete" type="button">DELETE THIS DECK</button>
     </div>
+   </div>
   </div>
 </div>
 
