tests/mutants/e_stale_pan_looks_live.patch
# kills: a held pan is never announced as the current one
# suite: node --test --test-name-pattern ^a.held.pan.is.never.announced.as.the.current.one$ tests/e2e.test.js
# The dim treatment goes, so a held or example pan is painted exactly as
# solidly as the seed in the box. The accessible name still says otherwise,
# which is the worse half of the same lie: a sighted user is told nothing at
# all while a screen reader is told the truth.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -512,7 +512,6 @@ button.nav:active{background:#2e281e}
    #f1ece1 plate on a #1f1b15 sheet is the loudest thing in the drawer, and on
    an empty box that is an example nobody typed. .62 and not lower because the
    pan is role="img" content, so the rim ink has to keep its contrast. */
-#scale-preview.stale{opacity:.62}
 #scale-preview svg{display:block; width:100%; height:auto}
 /* Geometry deliberately IDENTICAL to #scale-parse above, because since
    2026-09-21 this sits between the scale field and the pan preview and the two
