tests/mutants/e_swatch_hit_area.patch
# kills: every chip and sheet control has a 44px hit area
# suite: node --test --test-name-pattern ^every.chip.and.sheet.control.has.a.44px.hit.area$ tests/e2e.test.js
# Shrinks the palette swatch BUTTON back to the 14px dot it paints, leaving a
# 14px tap target - well under the minimum for a thumb. (Before lane 31 this
# mutant deleted a 44px ::after overlay; the target is now the button itself,
# so the same defect is now spelled as its width and height.)
diff --git a/index.html b/index.html
index 7d08ee3..3e4316a 100644
--- a/index.html
+++ b/index.html
@@ -267,7 +267,7 @@ button.nav:active{background:#2e281e}
    The dot keeps its 14px spec; the visible gap widens to 30px, which is the
    pitch 44px targets require. */
 #scale-swatches{display:flex; gap:0; align-items:center}
-#scale-swatches .dot{width:44px; height:44px; border:none; padding:0; background:none;
+#scale-swatches .dot{width:14px; height:14px; border:none; padding:0; background:none;
   position:relative; cursor:pointer}
 #scale-swatches .dot::after{content:""; position:absolute; left:50%; top:50%;
   width:14px; height:14px; margin:-7px 0 0 -7px; border-radius:50%;
