tests/mutants/e_swipe_direction_inverted.patch
# kills: a swipe past the threshold steps the deck in the swiped direction
# suite: node --test --test-name-pattern ^a.swipe.past.the.threshold.steps.the.deck.in.the.swiped.direction$ tests/e2e.test.js
# The swipe steps the wrong way: dragging the card left, which should pull the
# next card in, walks backwards instead. Both buttons and both arrow keys still
# work, so nothing outside the touch path notices.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -5086,7 +5086,7 @@
 card.addEventListener("touchend", e => {
   if (tx === null) return;
   const dx = e.changedTouches[0].clientX - tx; tx = null;
-  if (Math.abs(dx) > 55) step(dx < 0 ? 1 : -1);
+  if (Math.abs(dx) > 55) step(dx < 0 ? -1 : 1);
 }, { passive: true });
 
 /* ---------------- go ---------------- */
