tests/mutants/e_target_chrome_eats_card.patch
# kills: the header and footer stay inside their pixel budget, so the card keeps its size
# suite: node --test --test-name-pattern ^the.header.and.footer.stay.inside.their.pixel.budget..so.the.card.keeps.its.size$ tests/e2e.test.js
# Replaces the four chrome margins that come off the spacing ramp with fixed,
# generous literals - the kind of "a bit more air" edit this lane's brief
# invites. Nothing about the controls changes - every target is still 44px and
# still hit-tests to itself - so every tap-target assertion stays green. What
# moves is `main`, and because .scene is height:min(100%, ...) that comes
# straight off the card: ~45px of it in landscape. assertCardFits CANNOT see
# this, because its expectation min(cardW, main.height * ratio) is derived
# from the very quantity that moved. Only a guard with a FIXED expectation
# catches it.
diff --git a/index.html b/index.html
index 574a311..c3c313c 100644
--- a/index.html
+++ b/index.html
@@ -87,9 +87,9 @@ body{
    pins this against measured numbers. assertCardFits CANNOT: it derives its
    expectation from the current main height, so it moves with the regression.
    ------------------------------------------------------------------------ */
-header{width:100%; max-width:520px; text-align:center; margin-bottom:var(--sp-3)}
+header{width:100%; max-width:520px; text-align:center; margin-bottom:20px}
 h1{font-family:Marcellus, serif; font-weight:400; font-size:clamp(20px,5.5vw,27px);
-   letter-spacing:.04em; margin:0 0 var(--sp-2); color:#f4f0e8}
+   letter-spacing:.04em; margin:2px 0 16px; color:#f4f0e8}
 /* The chip row scrolls horizontally and never wraps; auto margins on the end
    chips keep it centred while it fits, without making either end unreachable
    once it overflows. The right edge fades so a cut-off chip reads as "more". */
@@ -156,7 +156,7 @@ h1{font-family:Marcellus, serif; font-weight:400; font-size:clamp(20px,5.5vw,27p
 .chip.on{color:#fff; border-image:linear-gradient(180deg,var(--dga) 0 50%,var(--dgb) 50% 100%) 1;
   border-radius:999px; border:1.5px solid var(--dga);
   box-shadow:0 0 0 1px color-mix(in srgb, var(--dgb) 55%, transparent)}
-.modebar{display:flex; gap:var(--sp-2); justify-content:center; margin-top:var(--sp-3)}
+.modebar{display:flex; gap:var(--sp-2); justify-content:center; margin-top:20px}
 /* min-height, NOT an oversized ::after overlay. The two are not equivalent:
    an overlay 44px tall on a 25.5px button hangs 9.25px past each edge, and
    .modebar has --sp-3 of margin above it and `main` below, so in landscape -
@@ -252,7 +252,7 @@ main{flex:1; display:flex; align-items:center; justify-content:center; width:100
    root/tone colours it sits between. */
 .sepc{color:#75707c}
 footer{width:100%; max-width:520px; display:flex; align-items:center;
-  justify-content:space-between; gap:var(--sp-2); margin-top:var(--sp-3)}
+  justify-content:space-between; gap:var(--sp-2); margin-top:20px}
 button.nav{flex:0 0 auto; width:56px; height:44px; border-radius:10px; border:1px solid #433b2c;
   background:#211d16; color:#eae6df; font-size:18px; cursor:pointer}
 button.nav:active{background:#2e281e}
