tests/mutants/f1b_share_checksum_shift.patch
# kills: encode's checksum is pinned against a captured minimal payload (Q18)
# suite: node --test --test-name-pattern ^encode.s.checksum.is.pinned.against.a.captured.minimal.payload..Q18.$ tests/share.test.js
# checksum's FNV-1a mixing shifts the high half by 15 bits instead of 16,
# changing every checksum's value while leaving encode/decode self-consistent
# (a round trip alone never notices). Any share link generated by this build
# fails to decode on any other build, and vice versa.
diff --git a/src/engine/share.js b/src/engine/share.js
--- a/src/engine/share.js
+++ b/src/engine/share.js
@@ -204,7 +204,7 @@ var HPE = (typeof HPE !== "undefined") ? HPE : {};
     for (var i = 0; i < bytes.length; i += 1) {
       hash = (hash ^ bytes[i]) >>> 0;
       hash = (((hash & 0xffff) * 0x01000193) +
-              ((((hash >>> 16) * 0x01000193) & 0xffff) << 16)) >>> 0;
+              ((((hash >>> 16) * 0x01000193) & 0xffff) << 15)) >>> 0;
     }
     return toAlphabet([(hash >>> 24) & 0xff, (hash >>> 16) & 0xff,
                        (hash >>> 8) & 0xff, hash & 0xff]);
