tests/mutants/g_bottom_cap_seven.patch
# suite: node --test --test-name-pattern ^a.seventh.bottom.field.is.rejected.TOO.MANY.RIM$ tests/layout.test.js
# kills: a seventh bottom field is TOO_MANY_RIM
diff --git a/src/engine/layout.js b/src/engine/layout.js
--- a/src/engine/layout.js
+++ b/src/engine/layout.js
@@ -22,7 +22,7 @@ var HPE = (typeof HPE !== "undefined") ? HPE : {};
 
   var RIM_MAX = 11;
   var INNER_MAX = 2;
-  var BOTTOM_MAX = 6;
+  var BOTTOM_MAX = 7;
 
   /* ---- D12 fixed geometry, anchored on the built-in literals ------------- */
 
