tests/mutants/g_geom_key_dropped.patch
# suite: node --test --test-name-pattern ^an.empty.zone.yields.zero..not.a.missing.key$ tests/layout.test.js
# kills: geom always carries every key pan() reads - n_out is emitted as 0, never omitted
diff --git a/src/engine/layout.js b/src/engine/layout.js
--- a/src/engine/layout.js
+++ b/src/engine/layout.js
@@ -261,7 +261,6 @@ var HPE = (typeof HPE !== "undefined") ? HPE : {};
       f_bnote: fBnote,
       f_num: fNum,
       n_in: round(nIn, 4),
-      n_out: round(nOut, 4),
       rim_num_out: rimNumOut,
       ext: ext
     };
