tests/mutants/h_decode_repairs.patch
# suite: node --test --test-name-pattern ^decode.propagates.parseSeed.s.own.code.for.an.invalid.seed$ tests/share.test.js
# kills: decode: a payload parseSeed refuses must be rejected, never repaired into an ok result
diff --git a/src/engine/share.js b/src/engine/share.js
--- a/src/engine/share.js
+++ b/src/engine/share.js
@@ -285,7 +285,8 @@ var HPE = (typeof HPE !== "undefined") ? HPE : {};
 
     // 5. The same validator the text box uses. It rejects, never repairs, so
     //    its code and reason are propagated unchanged.
-    return HPE.core.parseSeed(lines[0], options);
+    var seed = HPE.core.parseSeed(lines[0], options);
+    return seed.ok ? seed : ok({ fields: {}, options: options });
   }
 
   HPE.share = {
