tests/mutants/h_decode_repairs_options.patch
# suite: node --test --test-name-pattern ^decode.propagates.a.rejected.OPTION.rather.than.repairing.it$ tests/share.test.js
# kills: decode: a rejected seed OPTION must be propagated, not silently replaced by the defaults
diff --git a/src/engine/share.js b/src/engine/share.js
index a40e4d3..44457f0 100644
--- a/src/engine/share.js
+++ b/src/engine/share.js
@@ -285,7 +285,8 @@ var HPE = (typeof HPE !== "undefined") ? HPE : {};
 
     // 5. The same validator the text box uses. It rejects, never repairs, so
     //    its code and reason are propagated unchanged.
-    return HPE.core.parseSeed(lines[0], options);
+    var seed = HPE.core.parseSeed(lines[0], options);
+    return seed.ok ? seed : HPE.core.parseSeed(lines[0], null);
   }
 
   HPE.share = {
