tests/mutants/h_probe_missing_node_raises.patch
# kills: test_a_missing_node_binary_is_reported_not_raised
# suite: python3 -m unittest tests.test_suite_health.ProbeBrowserErrorTest.test_a_missing_node_binary_is_reported_not_raised
# Removes the probe's FileNotFoundError guard. On a machine with no `node` on
# PATH the gate dies with a traceback instead of reporting the cause. A health
# gate that crashes tells you less than one that says what is missing.
diff --git a/tests/suite_health.py b/tests/suite_health.py
--- a/tests/suite_health.py
+++ b/tests/suite_health.py
@@ -357,7 +357,7 @@ def probe_browser():
             stdout=subprocess.PIPE, stderr=subprocess.PIPE, text=True,
             cwd=paths.ROOT, start_new_session=True)
     except FileNotFoundError:
-        return False, "node: browser probe could not run - no `node` binary found"
+        raise
 
     try:
         try:
