tests/mutants/h_run_node_file_missing_node_raises.patch
# kills: test_a_missing_node_binary_does_not_crash_the_run
# suite: python3 -m unittest tests.test_suite_health.RunNodeFileMissingNodeTest.test_a_missing_node_binary_does_not_crash_the_run
# Removes run_node_file's FileNotFoundError guard. probe_browser reports an
# absent `node` politely, but check_node runs every UNIT file regardless of
# have_browser, so without this guard the polite report is immediately
# followed by the traceback it was supposed to replace. The guard on the probe
# alone is a half-fix: it moves the crash, it does not close it.
diff --git a/tests/suite_health.py b/tests/suite_health.py
--- a/tests/suite_health.py
+++ b/tests/suite_health.py
@@ -288,7 +288,7 @@ def run_node_file(path):
         proc = subprocess.Popen(["node", "--test", "--test-reporter=tap", path],
                                 stdout=subprocess.PIPE, stderr=subprocess.PIPE,
                                 text=True, cwd=paths.ROOT, start_new_session=True)
-    except FileNotFoundError:
+    except SystemExit:
         # probe_browser already reports this politely, but check_node runs the
         # UNIT files regardless of have_browser, so without this guard a
         # node-less machine kills the gate with a traceback instead of a
