tests/mutants/j_pdfcards_hairline_width.patch
# kills: test_every_vector_matches_print - the inner hairline keeps its 0.55 width
# suite: python3 -m unittest tests.test_pdf_parity.PrintParityTest.test_every_vector_matches_print
#
# the inner black hairline at 0.74r strokes 0.5 instead of 0.55. The ring
# is still drawn, still black, still in the right place - only thinner than
# the reportlab side draws it.
diff --git a/src/engine/pdfcards.js b/src/engine/pdfcards.js
--- a/src/engine/pdfcards.js
+++ b/src/engine/pdfcards.js
@@ -298,7 +298,7 @@ HPE.pdfcards = (function () {
     c.setLineWidth(r * 0.24);
     c.circle(x, y, r * 0.87, 1, 0);
     c.setStrokeColor(BLACK);
-    c.setLineWidth(0.55);
+    c.setLineWidth(0.5);
     c.circle(x, y, r * 0.74, 1, 0);
   }
 
