tests/mutants/k_pdfcards_bottom_dash_pattern.patch
# kills: test_every_vector_matches_print - the bottom ring dashes 2.2 on 2.2 off
# suite: python3 -m unittest tests.test_pdf_parity.PrintParityTest.test_every_vector_matches_print
#
# the bottom-shell ring dashes 2.4/2.4 instead of 2.2/2.2. Still dashed,
# still the same circle, a different rhythm from the one hifi.py:309 draws.
diff --git a/src/engine/pdfcards.js b/src/engine/pdfcards.js
--- a/src/engine/pdfcards.js
+++ b/src/engine/pdfcards.js
@@ -325,7 +325,7 @@ HPE.pdfcards = (function () {
     }
     if (g.bottom) {
       c.setStrokeColor([0.90, 0.90, 0.90]); c.setLineWidth(0.7);
-      c.setDash(2.2, 2.2);
+      c.setDash(2.4, 2.4);
       c.circle(cx, cy, R * g.bottom, 1, 0);
       c.setDash();
     }
