tests/mutants/n_case_from_pan.patch
# suite: node --test tests/naming.test.js
# kills: D10: case comes from stacked thirds over the parent
# Case comes from stacked thirds over the pan instead of the parent.
diff --git a/src/engine/naming.js b/src/engine/naming.js
index eda20de..705bcff 100644
--- a/src/engine/naming.js
+++ b/src/engine/naming.js
@@ -245,8 +245,7 @@ var HPE = (typeof HPE !== "undefined") ? HPE : {};
         // NO_THIRDS overrides D10: every numeral uppercase, no stacked thirds.
         casing = {lower: false, diminished: false};
       } else {
-        casing = caseFromParent(parentIndex, tonic, degreePc) ||
-                 caseFromPan(pan, degreePc);
+        casing = caseFromPan(pan, degreePc);
       }
       out[String(degreePc)] = num.accidental +
         (casing.lower ? num.roman.toLowerCase() : num.roman) +
