tests/mutants/n_parent_order_swap.patch
# suite: node --test tests/naming.test.js
# kills: PARENTS is tests/fixtures/parents.json, in the fixed list order
# Dorian precedes Aeolian, so D Amara's distance-0 tie is won by Dorian.
diff --git a/src/engine/naming.js b/src/engine/naming.js
index eda20de..79a61e5 100644
--- a/src/engine/naming.js
+++ b/src/engine/naming.js
@@ -53,8 +53,8 @@ var HPE = (typeof HPE !== "undefined") ? HPE : {};
 
   var PARENTS = [
     {name: "Ionian", display: "IONIAN", intervals: [0, 2, 4, 5, 7, 9, 11]},
-    {name: "Aeolian", display: "AEOLIAN", intervals: [0, 2, 3, 5, 7, 8, 10]},
     {name: "Dorian", display: "DORIAN", intervals: [0, 2, 3, 5, 7, 9, 10]},
+    {name: "Aeolian", display: "AEOLIAN", intervals: [0, 2, 3, 5, 7, 8, 10]},
     {name: "Phrygian", display: "PHRYGIAN", intervals: [0, 1, 3, 5, 7, 8, 10]},
     {name: "Lydian", display: "LYDIAN", intervals: [0, 2, 4, 6, 7, 9, 11]},
     {name: "Mixolydian", display: "MIXOLYD", intervals: [0, 2, 4, 5, 7, 9, 10]},
