tests/mutants/n_pdfcards_fill_only.patch
# kills: test_every_vector_matches_print - a fill-only path paints nonzero
# suite: python3 -m unittest tests.test_pdf_parity -k test_every_vector_matches_print
#
# mode() returns the nonzero "f" for a fill-only path where reportlab's
# Canvas, defaulting to FILL_EVEN_ODD, emits "f*". Only the trace's even_odd
# channel sees it: no point moves, no colour changes, no glyph shifts, and
# every other test in the repo still passes. 245 plain circles per Amara
# sheet paint with the wrong rule.
diff --git a/src/engine/pdfcards.js b/src/engine/pdfcards.js
--- a/src/engine/pdfcards.js
+++ b/src/engine/pdfcards.js
@@ -55,7 +55,7 @@ HPE.pdfcards = (function () {
   // revert one branch each and must stay killed.
   function mode(stroke, fill) {
     if (stroke && fill) return "B*";
-    if (fill) return "f*";
+    if (fill) return "f";
     return "S";
   }
 
