tests/mutants/n_rooted_ignored.patch
# suite: node --test --test-name-pattern ^the.rooted.flag.decides.whether.the.subtitle.carries.the.root$ tests/naming.test.js
# kills: the rooted flag decides whether the subtitle carries the root
# The rooted flag is ignored: every subtitle carries the root.
# Re-anchored 2026-09-16 (root-instance enumeration plan): subtitle() gained
# a 4th (voicingClass) parameter, shifting this hunk's line numbers.
diff --git a/src/engine/naming.js b/src/engine/naming.js
index eb6e61a..84044e0 100644
--- a/src/engine/naming.js
+++ b/src/engine/naming.js
@@ -180,7 +180,7 @@ var HPE = (typeof HPE !== "undefined") ? HPE : {};
   // `( = Xm6 )` on an m7b5, where X is the sixth a minor third above the root.
   function subtitle(rootName, suffix, equivRootName, voicingClass) {
     var q = quality(suffix);
-    var out = q.rooted ? rootName + " " + q.display : q.display;
+    var out = rootName + " " + q.display;
     if (equivRootName !== undefined && equivRootName !== null && equivRootName !== "") {
       if (suffix === "m7") {
         out += " ( = " + equivRootName + "6 )";
