tests/mutants/n_subtitle_cap_25.patch
# suite: node --test --test-name-pattern ^the.voicing.class.is.inside.the.subtitle.ceiling$ tests/naming.test.js
# kills: the voicing class is inside the subtitle ceiling
# Re-anchored 2026-09-16 (root-instance enumeration plan): SUBTITLE_MAX moved
# 26 -> 41 to fit "<rooted display> ( = <equiv> ) - HIGH VOICING", so the
# off-by-one mutant now targets 41 instead of 26. Same intent: the cap is one
# character short of the longest real subtitle the engine can emit.
diff --git a/src/engine/naming.js b/src/engine/naming.js
--- a/src/engine/naming.js
+++ b/src/engine/naming.js
@@ -77,7 +77,7 @@ var HPE = (typeof HPE !== "undefined") ? HPE : {};
   // Pygmy deck already prints a 27-char subtitle ("Eb DOMINANT 7 - LOW
   // VOICING") without incident, because naming.subtitle() is called from one
   // place (select.js) and that call only runs for generated decks.
-  var SUBTITLE_MAX = 41;
+  var SUBTITLE_MAX = 40;
 
   /* ---- degree reference scales (D8) ------------------------------------- */
 
