tests/mutants/p_paper_picker_forgets_its_state.patch
# kills: print CTA: the paper picker reports the paper that will actually print
# suite: node --test --test-name-pattern actually.print tests/app.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4351,8 +4351,8 @@ function headerHTML(d, ch, n, noPrints) {
       <button type="button" onclick="openPrintSheet('full')">FULL DECK PDF</button>
       <button type="button" onclick="openPrintSheet('shop')">PRINT-ONLY PDF</button>
       <select aria-label="Paper size" onchange="setPrintPaper(this.value)">
-        <option value="letter"${printPaper === "letter" ? " selected" : ""}>LETTER</option>
-        <option value="a4"${printPaper === "a4" ? " selected" : ""}>A4</option>
+        <option value="letter">LETTER</option>
+        <option value="a4">A4</option>
       </select>
     </div>`;
   return `<div class="hdr">
