tests/mutants/p_print_container_left_populated.patch
# kills: print sheet leaves no residue
# suite: node --test --test-name-pattern print.sheet.leaves.no.residue tests/app.test.js
# The container is re-hidden but never emptied, so a whole deck's worth of
# printed faces stays parked in the live DOM after every print - duplicate
# ids, duplicate pan SVGs, and a second copy of the deck for any selector
# that does not scope itself to #card. Nothing on screen changes (AC-B5).
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4315,7 +4315,6 @@ function printSheetHTML(d, variant, name) {
    and a print the user started themselves (Cmd+P, iOS Share -> Print). */
 function teardownPrintSheet() {
   const root = document.getElementById("printroot");
-  root.innerHTML = "";
   root.hidden = true;
   document.body.classList.remove("printing");
   document.getElementById("printgeom").textContent = "";
