tests/mutants/p_print_cta_drops_the_platform.patch
# kills: the CTA passes the real platform through, not just the viewport
# suite: node --test --test-name-pattern CTA.passes.the.real.platform tests/app.test.js
# printLayoutName keeps its platform clause but the CTA stops handing it the
# user agent, so isIOS(undefined) is always false and every iOS device above
# 640px falls back to the wide sheet. The clause is only as good as its
# argument; a unit test on the function alone would never see this.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4388,7 +4388,7 @@ function openPrintSheet(variant) {
     // stylesheet below. The container carries no layout class: nothing in
     // @media print selects on one, so a class would only be a second decision
     // point free to drift from this one.
-    const name = printLayoutName(window.innerWidth, navigator.userAgent);
+    const name = printLayoutName(window.innerWidth);
     document.getElementById("printgeom").textContent = printGridCSS(name, printPaper);
     root.innerHTML = printSheetHTML(deck(), variant, name);
     root.hidden = false;
