tests/mutants/p_print_fill_parent_dropped.patch
# kills: the print stylesheet gives the page box something to fill
# suite: node --test --test-name-pattern ^the.print.stylesheet.gives.the.page.box.something.to.fill$ tests/app.test.js
# Drops `body.printing #printroot,` from the fill rule. .printpage's height:100%
# then has no resolved parent height, collapses to the min-height floor, and the
# sheet top-aligns flush with the paper edge - the 43b2851 regression.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -777,7 +777,7 @@ button.nav:active{background:#2e281e}
      is what made every sheet paginate onto two pages. Floor and fill
      together - neither alone is correct. */
   html,body{height:100%; min-height:0; overflow:visible}
-  body.printing #printroot, body.printing #printroot .printpage{height:100%}
+  body.printing #printroot .printpage{height:100%}
   /* The safe-area padding is an on-screen notch reservation and has no meaning
      on paper; left in, it shifts every page by the device's insets. */
   body{margin:0; padding:0; background:#fff; display:block}
