tests/mutants/p_print_footprint_unrotated.patch
# kills: the print stylesheet never declares a page-box height
# suite: node --test --test-name-pattern ^the.print.stylesheet.never.declares.a.page.box.height$ tests/app.test.js
# The reservation must be the sheet's height AFTER rotation. Swapping the arms
# reserves 494.4pt for a sheet that paints 532.8pt tall, so the bottom row is
# sliced again - the exact defect the owner photographed, at a smaller margin.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4239,7 +4239,7 @@ function printGridCSS(name, paper) {
   const sh = L.rows * g.CH + (L.rows - 1) * L.gy;
   // Rounded: 3 * 247.2 + 2 * 9.4 lands on 760.3999999999999 in binary float,
   // and a stylesheet is text a human reads in devtools.
-  const footprint = Math.round((L.rotate ? sw : sh) * 100) / 100;
+  const footprint = Math.round((L.rotate ? sh : sw) * 100) / 100;
   return `@page{size:${p.css}; margin:0}\n` +
     `#printroot .printpage{min-height:${footprint}pt}\n` +
     `#printroot .printsheet{grid-template-columns:repeat(${L.cols}, ${g.CW}pt);` +
