tests/mutants/p_print_ios_ipad_desktop_ua_dropped.patch
# kills: iPadOS in desktop mode is still treated as iOS
# suite: node --test --test-name-pattern ^iPadOS.in.desktop.mode.is.still.treated.as.iOS$ tests/app.test.js
# Reviewer R2: iPadOS defaults to Request Desktop Website, so a real iPad
# sends a Macintosh UA and only the maxTouchPoints clause catches it. Without
# it an iPad falls through to the width rule and gets the 557.2 x 760.4pt wide
# sheet, which misses the printable box on both axes.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4199,9 +4199,7 @@ const PRINT_PAPER = { letter: { css: "letter" }, a4: { css: "A4" } };
  */
 function isIOS(ua) {
   const s = String(ua || "");
-  return /iPad|iPhone|iPod/.test(s) ||
-    // iPadOS 13+ reports a desktop Macintosh UA but still has touch points.
-    (/Macintosh/.test(s) && typeof navigator !== "undefined" && navigator.maxTouchPoints > 1);
+  return /iPad|iPhone|iPod/.test(s);
 }
 
 /** AC-B5b: slots-per-page is decided ONCE, here. The name this returns picks
