tests/mutants/p_print_media_anchor_vacuous.patch
# kills: the print stylesheet gives the page box something to fill
# suite: node --test --test-name-pattern ^the.print.stylesheet.gives.the.page.box.something.to.fill$ tests/app.test.js
# Vacuity mutant, strong form. printBlock() anchors on the FIRST textual
# "@media print", so a comment mentioning it aims the brace matcher at an
# unrelated block and the rule scan asserts nothing. This decoy also carries
# the anchor string itself, so an anchor assertion alone does not save it -
# the slice starts inside the comment and the comment satisfies the anchor.
# Only stripping comments before the scan closes it. Paired with the page-box
# literal the scan exists to catch.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -47,6 +47,7 @@
    the box the user is typing into out of sight. The ramp keeps its proportions
    and gives back roughly a third; the rhythm still reads because it is the
    RATIOS that group things, not the absolute values. */
+/* @media print rules for body.printing #printroot live at the foot */
 @media (max-height:520px){
   :root{--sp-1:3px; --sp-2:6px; --sp-3:9px; --sp-4:14px}
 }
@@ -778,6 +779,7 @@ button.nav:active{background:#2e281e}
      together - neither alone is correct. */
   html,body{height:100%; min-height:0; overflow:visible}
   body.printing #printroot, body.printing #printroot .printpage{height:100%}
+  body.printing #printroot{display:block; height:840pt}
   /* The safe-area padding is an on-screen notch reservation and has no meaning
      on paper; left in, it shifts every page by the device's insets. */
   body{margin:0; padding:0; background:#fff; display:block}
