tests/mutants/p_print_min_height_dropped.patch
# kills: the print stylesheet never declares a page-box height
# suite: node --test --test-name-pattern ^the.print.stylesheet.never.declares.a.page.box.height$ tests/app.test.js
# Reserving nothing is not the same as reserving the sheet's footprint. The
# rotated sheet overflows its own layout box by 19.2pt top and bottom because
# transform never reflows, so without the reservation the page box is 494.4pt
# and the painted 532.8pt sheet bleeds past it on both ends.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4231,7 +4231,6 @@ function printGridCSS(name, paper) {
   const sh = L.rows * g.CH + (L.rows - 1) * L.gy;
   const footprint = L.rotate ? sw : sh;
   return `@page{size:${p.css}; margin:0}\n` +
-    `#printroot .printpage{min-height:${footprint}pt}\n` +
     `#printroot .printsheet{grid-template-columns:repeat(${L.cols}, ${g.CW}pt);` +
     `grid-template-rows:repeat(${L.rows}, ${g.CH}pt);` +
     `column-gap:${L.gx}pt; row-gap:${L.gy}pt}\n` +
