tests/mutants/p_print_narrow_gy_restored.patch
# kills: every print layout fits inside the platform-enforced printable area
# suite: node --test --test-name-pattern every.print.layout.fits tests/app.test.js
# Reviewer finding N2 from the PR #106 review: the narrow row gutter was free
# on its own axis, bounded only by arithmetic that left it anywhere from 0 to
# 225.6pt. Restoring gy alone (gx left at 0) must fail on the value pin, not
# on the fit sum - the rotated sheet's 532.8pt of height would still clear
# 702pt with a 9.4pt gutter, so arithmetic alone never catches this.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4168,7 +4168,7 @@ const PRINT_GEOM = { PW: 612, PH: 792, CW: 177.6, CH: 247.2, GX: 12.2, GY: 9.4 }
  */
 const PRINT_LAYOUTS = {
   wide: { cols: 3, rows: 3, gx: PRINT_GEOM.GX, gy: PRINT_GEOM.GY },
-  narrow: { cols: 3, rows: 2, gx: 0, gy: 0, rotate: true, constrained: true },
+  narrow: { cols: 3, rows: 2, gx: 0, gy: PRINT_GEOM.GY, rotate: true, constrained: true },
 };
 
 /** The printable area a platform that ignores `@page` leaves us, per side.
