tests/mutants/p_print_page_fill_dropped.patch
# kills: the sheet centres in the page box instead of top-aligning at the paper edge
# suite: node --test --test-name-pattern page.box.something.to.fill tests/app.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -776,8 +776,7 @@ button.nav:active{background:#2e281e}
      the floor that stops the block ever being shorter than the sheet, which
      is what made every sheet paginate onto two pages. Floor and fill
      together - neither alone is correct. */
-  html,body{height:100%; min-height:0; overflow:visible}
-  body.printing #printroot, body.printing #printroot .printpage{height:100%}
+  html,body{height:auto; min-height:0; overflow:visible}
   /* The safe-area padding is an on-screen notch reservation and has no meaning
      on paper; left in, it shifts every page by the device's insets. */
   body{margin:0; padding:0; background:#fff; display:block}
