tests/mutants/p_print_parent_height_literal.patch
# kills: the print stylesheet gives the page box something to fill
# suite: node --test tests/app.test.js
# Launders a hard page-box literal through #printroot, the parent .printpage's
# percentage resolves against. 840pt over iOS's ~711.6pt printable box
# paginates - every sheet becomes two physical pages, the 43b2851 class.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -777,6 +777,7 @@ button.nav:active{background:#2e281e}
      is what made every sheet paginate onto two pages. Floor and fill
      together - neither alone is correct. */
   html,body{height:100%; min-height:0; overflow:visible}
+  body.printing #printroot{display:block; height:840pt}
   body.printing #printroot, body.printing #printroot .printpage{height:100%}
   /* The safe-area padding is an on-screen notch reservation and has no meaning
      on paper; left in, it shifts every page by the device's insets. */
