tests/mutants/p_printscale_clipped_by_pagination.patch
# kills: every printed card keeps its full height on every page
# suite: node --test --test-name-pattern full.height.on.every.page tests/e2e.test.js
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -754,7 +754,7 @@ button.nav:active{background:#2e281e}
    bottom row's diagram. `relative` and not `static` because .printcell .face
    is absolutely positioned and needs this element as its containing block -
    under static the face would resolve against .printcell and shrink twice. */
-#printroot .printscale{position:relative; top:0; left:0; transform-origin:top left}
+#printroot .printscale{position:absolute; top:0; left:0; transform-origin:top left}
 #printroot .printcell .face{position:absolute; inset:0; box-shadow:none;
   backface-visibility:visible; -webkit-backface-visibility:visible}
 #printroot .printname{padding:0 13px; font-family:Marcellus, Georgia, serif;
