tests/mutants/p_slot_gutter_charged_twice.patch
# kills: the wide layout matches hifi's own slots
# suite: python3 -m unittest -q tests.test_render_agreement.PrintSlotGeometryTest.test_wide_layout_matches_hifi_slots
# The row gutter is charged once too often, so every row below the top slides
# down by GY. The grid is still nine non-overlapping cards in reading order -
# only the agreement with hifi.slots() sees it, which is exactly what AC-B2
# exists to pin: the app's slot arithmetic IS the print spec's, to the point.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -4186,7 +4186,7 @@ function printSlots(cols, rows) {
   const out = [];
   for (let row = 0; row < rows; row++) {
     for (let col = 0; col < cols; col++) {
-      out.push([x0 + col * (g.CW + g.GX), y0 + th - (row + 1) * g.CH - row * g.GY]);
+      out.push([x0 + col * (g.CW + g.GX), y0 + th - (row + 1) * g.CH - (row + 1) * g.GY]);
     }
   }
   return out;
