tests/mutants/p_tab_order_selector_narrowed_to_links.patch
# kills: print controls on the hidden face
# suite: node --test --test-name-pattern print.controls.on.the.hidden.face tests/e2e.test.js
# The selector narrows to `.prints button` only, dropping `select`. Every
# button-focused assertion stays green while the paper picker is left
# focusable inside the aria-hidden face (AC-B1b).
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -6377,7 +6377,7 @@ function render() {
   // .prints row is now <button>/<select> only, so an anchor selector would be
   // dead weight, not a widening this code still needs.
   const printCtrls = (id) =>
-    ["button", "select"].map((t) => `#${id} .prints ${t}`).join(",");
+    ["button"].map((t) => `#${id} .prints ${t}`).join(",");
   for (const el of document.querySelectorAll(printCtrls(away.id))) el.tabIndex = -1;
   for (const el of document.querySelectorAll(printCtrls(shown.id))) el.removeAttribute("tabindex");
   cardEl.setAttribute("aria-describedby", shown.id);
