tests/mutants/r_num_size_app_fudge.patch
# kills: test_diagram_number_sizes_agree
# suite: python3 -m unittest -k test_diagram_number_sizes_agree tests.test_render_agreement
# Gives the app its own fudge factor on the index number, so the two
# renderers stop drawing the same diagram.
diff --git a/index.html b/index.html
--- a/index.html
+++ b/index.html
@@ -3721,7 +3721,7 @@
        : zone === "bottom" ? LABEL_RATIO_BNOTE : LABEL_RATIO_NOTE;
 }
 function labelSize(r, zone) { return r * labelRatio(zone); }
-function numSize(rNote) { return rNote * NUM_RATIO; }
+function numSize(rNote) { return rNote * NUM_RATIO * 1.1; }
 
 /* ---------------- SVG pan ---------------- */
 /* The scale page selects a note by TAPPING THE PAN, so pan() can emit an
