tests/mutants/s_cap_removed.patch
# suite: node --test --test-name-pattern ^the.cap.bites.on.the.12.note.pan..27.candidates..25.cards$ tests/select.test.js
# kills: the ENGINE-SPEC section 8 cap itself. With no trim the 12-note pan
# ships all 27 collapsed candidates instead of 25.
diff --git a/src/engine/select.js b/src/engine/select.js
--- a/src/engine/select.js
+++ b/src/engine/select.js
@@ -106,7 +106,7 @@ var HPE = (typeof HPE !== "undefined") ? HPE : {};
   // canonical order are all untouched by this.
   function cap(fields) {
     var fieldCount = ids(fields).length;
-    return CAP_BASE + Math.max(0, fieldCount - CAP_HINGE);
+    return 9999;
   }

   /* ---- section 8: raw candidates ---------------------------------------- */
