tests/mutants/s_ding_only_root.patch
# suite: node --test tests/select.test.js
# kills: ENGINE-SPEC section 8, "a pitch class that exists only on the ding
# cannot be a root or a chord tone".
diff --git a/src/engine/select.js b/src/engine/select.js
index 6ec8d54..14897c2 100644
--- a/src/engine/select.js
+++ b/src/engine/select.js
@@ -106,7 +106,7 @@ var HPE = (typeof HPE !== "undefined") ? HPE : {};
   // the trim of section 5 is a voicing step.
   function candidates(fields) {
     var qualities = naming().QUALITIES;
-    var roots = pcsWhere(fields, nonDing);
+    var roots = pcsWhere(fields, anyField);
     var playable = roots;
     var top = pcsWhere(fields, isTopShell);
 
