tests/mutants/s_extended_off_top_shell.patch
# suite: node --test --test-name-pattern ^an.extended.quality.is.a.candidate.only.on.the.TOP.shell$ tests/select.test.js
# kills: ENGINE-SPEC section 8, "an extended-tier quality is a candidate only
# when every one of its tones lies on the TOP shell".
diff --git a/src/engine/select.js b/src/engine/select.js
--- a/src/engine/select.js
+++ b/src/engine/select.js
@@ -121,7 +121,7 @@ var HPE = (typeof HPE !== "undefined") ? HPE : {};
       for (var s = 0; s < suffixes.length; s += 1) {
         var quality = qualities[suffixes[s]];
         if (!has(TIERS, quality.tier)) continue;
-        var available = quality.tier === "extended" ? top : playable;
+        var available = playable;
         var fits = true;
         for (var i = 0; i < quality.intervals.length; i += 1) {
           if (!has(available, pc(roots[r] + quality.intervals[i]))) {
