tests/mutants/u_before_forgets_the_ding.patch
# suite: node --test --test-name-pattern ^NOTE_OUT_OF_ORDER.names.the.ding.as.the.ding..and.an.explicit.note.plainly$ tests/core.test.js
# kills: the element a top note had to clear is named as the ding when it is the ding, so "A2 is not above D3" cannot be read as a missing rim note
diff --git a/src/engine/core.js b/src/engine/core.js
index d5690cb..e87e305 100644
--- a/src/engine/core.js
+++ b/src/engine/core.js
@@ -136,7 +136,7 @@ var HPE = (typeof HPE !== "undefined") ? HPE : {};
   // <B>: the element the offending note had to clear, flagged when the octave
   // in it is the parser's inference rather than the user's typing.
   function before(note, midi, isDing) {
-    return (isDing ? "the ding " : "") + placed(note, midi) +
+    return placed(note, midi) +
            (note.typed ? "" : " (inferred from " + note.token + ")");
   }
 
