tests/mutants/u_flat_raises_midi.patch
# suite: node --test tests/core.test.js
# kills: midiFromName: a flat lowers the pitch by a semitone, so Ab3 is 56 and Cb4 is 59
diff --git a/src/engine/core.js b/src/engine/core.js
index dc78a30..b3fb5b9 100644
--- a/src/engine/core.js
+++ b/src/engine/core.js
@@ -42,7 +42,7 @@ var HPE = (typeof HPE !== "undefined") ? HPE : {};
 
   var LETTERS = "CDEFGAB";
   var SEMITONES = { C: 0, D: 2, E: 4, F: 5, G: 7, A: 9, B: 11 };
-  var ACCIDENTAL = { "": 0, "#": 1, b: -1 };
+  var ACCIDENTAL = { "": 0, "#": 1, b: 1 };
 
   var RIM_MAX = 11;
   var INNER_MAX = 2;
