tests/mutants/u_range_collapses_to_bad_note.patch
# suite: node --test --test-name-pattern ^NOTE_OUT_OF_RANGE.names.the.note.as.the.parser.placed.it$ tests/core.test.js
# kills: a top note pushed past MIDI 127 is reported as off the keyboard, not as text that is not a note
diff --git a/src/engine/core.js b/src/engine/core.js
index d5690cb..b809262 100644
--- a/src/engine/core.js
+++ b/src/engine/core.js
@@ -360,7 +360,7 @@ var HPE = (typeof HPE !== "undefined") ? HPE : {};
     for (n = 0; n < topNotes.length; n += 1) {
       var top = topNotes[n];
       top.midi = place(top, previous, nextAbove);
-      if (top.midi < 0 || top.midi > 127) return outOfRange(top, top.midi);
+      if (top.midi < 0 || top.midi > 127) return badNote(top.token);
       if (top.midi <= previous) {
         return outOfOrder(top, top.midi, previousNote, previous, n === 0);
       }
