tests/mutants/u_repeat_reads_as_out_of_order.patch
# suite: node --test --test-name-pattern ^NOTE_REPEATED.names.the.note.that.is.already.on.that.shell$ tests/core.test.js
# kills: the same note twice in a row reads as a repeat, not as the riddle "C4 is not above C4"
diff --git a/src/engine/core.js b/src/engine/core.js
index 4605b49..6fdd34f 100644
--- a/src/engine/core.js
+++ b/src/engine/core.js
@@ -177,9 +177,6 @@ var HPE = (typeof HPE !== "undefined") ? HPE : {};
         "<B>": before(prevNote, prevMidi)
       }, "ding");
     }
-    if (placed(note, midi) === placed(prevNote, prevMidi)) {
-      return repeated(note, midi, prevNote, prevMidi);
-    }
     return err("NOTE_OUT_OF_ORDER", {
       "<A>": placed(note, midi),
       "<B>": before(prevNote, prevMidi)
