tests/mutants/v_any_instance_above.patch
# suite: node --test --test-name-pattern ^D11.unforced.chords.take.the.nearest.instance.above.the.root$ tests/voicing.test.js
# kills: the D11 tie-break, "the NEAREST instance above the root". Here an
# unforced tone takes any instance above the root (the highest one), which
# CLAUDE.md rule 3 as worded would still permit but D11 does not.
diff --git a/src/engine/voicing.js b/src/engine/voicing.js
--- a/src/engine/voicing.js
+++ b/src/engine/voicing.js
@@ -294,7 +294,7 @@ var HPE = (typeof HPE !== "undefined") ? HPE : {};
       var tone = tones[u];
       var field;
       if (!forced) {
-        field = tone.up.length ? tone.up[0] : tone.down[0];
+        field = tone.up.length ? tone.up[tone.up.length - 1] : tone.down[0];
       } else if (tone.interval < OCTAVE) {
         field = tone.down.length ? tone.down[0] : tone.up[0];
       } else {
