tests/mutants/v_cluster_takes_lowest_below.patch
# suite: node --test --test-name-pattern ^D2.forced.chords.cluster.chord.tones.to.the.highest.instance.below.the.root$ tests/voicing.test.js
# kills: D2 "every chord tone moves to its HIGHEST instance below the root".
# Here a clustered chord tone takes the LOWEST instance below the root, so Pygmy Gm7b5 from G5 takes F4 instead of F5.
diff --git a/src/engine/voicing.js b/src/engine/voicing.js
index 869291e..378ba43 100644
--- a/src/engine/voicing.js
+++ b/src/engine/voicing.js
@@ -296,7 +296,7 @@ var HPE = (typeof HPE !== "undefined") ? HPE : {};
       if (!forced) {
         field = tone.up.length ? tone.up[0] : tone.down[0];
       } else if (tone.interval < OCTAVE) {
-        field = tone.down.length ? tone.down[0] : tone.up[0];
+        field = tone.down.length ? tone.down[tone.down.length - 1] : tone.up[0];
       } else {
         field = tone.up.length ? tone.up[0] : tone.down[0];
       }
