tests/mutants/v_ding_in_voicing.patch
# suite: node --test tests/voicing.test.js
# kills: the section 5 invariant that the ding never appears in a voicing.
# playable() stops skipping the ding, so candidate sets carry ding fields.
diff --git a/src/engine/voicing.js b/src/engine/voicing.js
index b25fcbf..d944dab 100644
--- a/src/engine/voicing.js
+++ b/src/engine/voicing.js
@@ -67,7 +67,6 @@ var HPE = (typeof HPE !== "undefined") ? HPE : {};
     for (var key in fields) {
       if (!Object.prototype.hasOwnProperty.call(fields, key)) continue;
       var rec = fields[key];
-      if (isDing(rec)) continue;
       out.push({ id: Number(key), midi: rec[2], zone: rec[3], top: isTopShell(rec) });
     }
     out.sort(function (a, b) { return a.id - b.id; });
